[
  {
    "abstract": "Tujuan dari penelitian ini adalah: 1) mengidentifikasi keterampilan Computational Thinking yang dapat diperoleh melalui Game-Based Learning sesuai kerangka kerja Brennan & Resnick. 2) mengidentifikasi langkah – langkah mengenalkan Computational Thinking melalui Game-Based Learning.Penelitian ini merupakan penelitian kualitatif dengan desain pendekatan desain skenario dan aktivitas pemrograman. Partisipan dalam penelitian ini merupakan siswa SMK IT Smart Informatika tahun ajaran 2021/2022 sebanyak enam siswa dengan pertimbangan siswa kelas XII yang pernah belajar pemrograman dan atau pernah membuat proyek berbasis pemrograman. Teknik pengumpulan data yang digunakan oleh peneliti pada penelitian ini yakni berupa kuesioner, observasi dan wawancara. Dari ketiga jenis data yang dikumpulkan, agar dapat dipertanggungjawabkan kebenarannya dan dapat dibuktikan keabsahannya, peneliti menerapkan empat kriteria dalam tahap uji validitas data yaitu kredibilitas, transferabilitas, dependabilitas, konfirmabilitas. Observasi dan wawancara digunakan untuk mengetahui apakah ada indikasi perkembangan keterampilan Computational Thinking sesuai dengan kerangka Brennan & Resnick dan kuesioner digunakan untuk mengetahui tingkat kesadaran siswa dalam mempraktikkan keterampilan Computational Thinking tersebut. Data yang terkumpul dianalisis dengan teknik analisis deskriptif kualitatif.Hasil penelitian menunjukkan bahwa penggunaan Game-Based Learning dengan mengadopsi aplikasi Alice 3 dapat digunakan sebagai alat untuk mengindikasi perkembangan keterampilan CT pada siswa SMK sesuai dengan kerangka kerja Brennan & Resnick. Hal ini ditinjau dari hasil analisis deskriptif data observasi dan wawancara yang menunjukan kesesuaian dengan indikator – indikator perkembangan keterampilan CT. Semua keterampilan CT berhasil teridentifikasi melalui observasi. Namun, hanya keterampilan sequences, being incremental and iterative, testing and debugging, reusing and remixing, abstracting and modularizing, expressing, connecting, dan questioning yang bisa teridentifikasi melalui wawancara. Game-Based Learning diterapkan dalam pembelajaran dengan menggunakan pendekatan desain skenario dan aktivitas pemrograman. Pendekatan ini mampu mencakup tiga dimensi keterampilan CT dalam kerangka kerja Brennan & Resnick mulai dari CT Concept, CT Practices, dan CT Perspectives. Hal ini dikonfirmasi pada hasil analisis data observasi dan wawancara yang menunjukan kesesuaian dengan indikator – indikator keterampilan CT menurut kerangka kerja Brennan & Resnick.Kata kunci: alice 3, brennan & resnick, computational thinking, game-based learning",
    "id": 1,
    "title": "Tinjauan Pengaruh Game-Based Learning Terhadap Perkembangan Computational Thinking Skills dari Perspektif Teori Brennan & Resnick"
  },
  {
    "abstract": "Penggunaan teknologi dalam pembelajaran menjadikan kebutuhan akan aplikasi maupun media pembelajaran yang dapat meningkatkan kemampuan berpikir kritis siswa. Dengan adanya model SAMR (Subtitution, Augmentation, Modification dan Redefinition) yang menawarkan metode pengajaran dengan mengintegrasikan teknologi dapat memengaruhi proses pembelajaran dalam meningkatkan kemampuan berpikir kritis siswa. Penelitian kuantitatif ini menggunakan metode eksperimen dengan desain Posttest Only Control Design dengan membagi sampel menjadi 2 kelompok (kelas kontrol dan kelas eksperimen) dengan teknik pengambilan sampel cluster random sampling pada 54 siswa. Hasil posttest kemampuan kognitif kelas kontrol didapatkan nilai rata-rata sebesar 16,52 dan pada kelas eksperimen sebesar 19,63. Selanjutnya hasil posttest kemampuan afektif kelas kontrol didapatkan nilai rata-rata sebesar 74,76 dan pada kelas eksperimen sebesar 84,07. Hal ini menunjukkan adanya perbedaan kemampuan berpikir kritis siswa antara siswa yang menggunakan model SAMR dengan siswa yang tidak menggunakan model SAMR. Pada hasil analisis nilai Gain yang telah dilakukan pada nilai posttest kemampuan kognitif kelas kontrol dan kelas eksperimen diperoleh nilai gain sebesar 0,33 yang termasuk kedalam kriteria Sedang. Sedangkan nilai Gain pada nilai posttest kemampuan kognitif kelas kontrol dan kelas eksperimen diperoleh nilai gain sebesar 0,19 yang termasuk kedalam kriteria Rendah. Penelitian ini membuktikan bahwa penggunaan model SAMR berpengaruh terhadap kemampuan berpikir kritis siswa dan model SAMR terbukti efektif untuk meningkatkan kemampuan berpikir kritis siswa.Kata kunci: kemampuan berpikir kritis, model SAMR, teknologi dalam pendidikan.",
    "id": 2,
    "title": "PENGARUH PENGGUNAAN MODEL SAMR (SUBTITUTION, AUGMENTATION, MODIFICATION AND REDEFINITION) TERHADAP KEMAMPUAN BERPIKIR KRITIS SISWA PADA MATA PELAJARAN PEMROGRAMAN DASAR KELAS X MULTIMEDIA SMK BATIK 2 SURAKARTA"
  },
  {
    "abstract": "Penelitian ini bertujuan untuk mengelompokkan mahasiswa Pendidikan Teknik Informatika dan Komputer, Fakultas Keguruan dan Ilmu Pendidikan, Universitas Sebelas Maret berdasarkan kemiripan gaya belajar tiap mahasiswa dan menganalisis karakteristik pada kelompok yang terbentuk. Dalam penelitian ini menggunakan model gaya belajar Felder dan Silverman (FSLSM) yang mencakup empat dimensi antara lain (1) Active/Reflective; (2) Sensing/Intuitive; (3) Visual/Verbal; dan (4) Sequential/Global;Penelitian ini merupakan penelitian deskriptif kuantitatif. Sampel dalam penelitian ini adalah 58 mahasiswa semester II Program Studi Pendidikan Teknik Informatika dan Komputer, Fakultas Keguruan dan Ilmu Pendidikan, Universitas Sebelas Maret. Pemilihan sampel menggunakan teknik purposive sampling. Pengukuran skor gaya belajar dilakukan dengan menggunakan instrumen Index of Learning Styles yang dikembangkan oleh Felder dan Solomon (1993). Pengelompokan mahasiswa berdasarkan kemiripan gaya belajar Index of Learning Styles dilakukan dengan analisis cluster menggunakan metode hierarchical clustering dan menggunakan teknik average linkage berbantuan software SPSS versi 23.Hasil penelitian ini menunjukkan bahwa terbentuk 2 cluster dominan yang menunjukkan perbedaan dimensi gaya belajar. Cluster 1 memiliki kecenderungan reflective pada dimensi proses belajar dengan rata-rata -3,76, kecenderungan sensing dalam persepsi belajar dengan rata-rata 4,24, kecenderungan visual dalam penginputan informasi dengan rata-rata 5,21, dan kecenderungan global pada dimensi pemahaman informasi dengan rata-rata -2,66. Sedangkan cluster 2 memiliki kecenderungan active pada dimensi proses belajar dengan rata-rata 2,52, kecenderungan sensing dalam persepsi belajar dengan rata-rata 1,48, kecenderungan visual dalam penginputan informasi dengan rata-rata 5,08, dan kecenderungan global pada dimensi pemahaman informasi dengan rata-rata -0,04.",
    "id": 3,
    "title": "Analisis Cluster untuk Pengelompokan Mahasiswa Berdasarkan Index of Learning Styles dengan Metode Hierarchical Clustering"
  },
  {
    "abstract": "Merebaknya virus covid-19 menimbulkan perubahan dalam dunia pendidikan dimana pembelajaran dialihkan menjadi secara daring dengan berbasis teknologi. Pembelajaran daring dimasa pandemi memiliki beberapa kelemahan yaitu leterampilan dalam pemanfaatan teknologi. Ketidakstabilan jaringan internet, keterbatasan perangkat teknologi, pemanfaaatan teknologi yang kurang tepat, dan rentan terhadap kriminalitas. Penerapan laboratorium virtual berbasis private cloud IaaS mejadi referensi yang tepat untuk digunakan sebagai media pembelajaran praktikum mata kuliah jaringan di program studi PTIK UNS pada situasi pandemi Covid-19.Pengembangan laboratorium virtual dibangun dengan langkah yaitu 1) Setup network hardware 2) Instalasi dan klasterisasi Proxmox VE; 3) Membuat Virtual Machine dan Container:4) Manajemen acces user; 5) Setup server VPN dengan OpenVPN. Fungsionalitas Laboratorium virtual diuji dengan mengacu pada instrument Blackbox testing dengan metode requirement testing. Penerimaan teknologi mengacu pada Technology Acceptence Model (TAM) yang menunjukan hasil diterima dalam pembelajaran praktikum mata kuliah administrasi jaringan komputer ditunjukkan dengan rata-rata hasil analisis cluster positif yang tinggi pada aspek kebermanfaatan (79,9%), aspek kemudahan dalam penggunaan (72,2%), aspek E-learning self- Efficacy (71,7%), aspek niat perilaku untuk menggunakan (57%), dan aspek penggunaan sesungguhnya (40,6%). Aspek kerumitan memiliki hasil cluster netral dan negatif tinggi yaitu 38,3?n 35,8%. Tetapi hasil tersebut menunjukan dari tingkat kerumitan yang rendah. Yang perlu menjadi perhatian adalah pada aspek keterbatasan waktu dimana rata-rata nilai cluster postifnya tinggi (40,8%).Kata kunci: Laboratorium Virtual, Cloud Computing, Covid-19. ",
    "id": 4,
    "title": "Rancang Bangun Laboratorium Virtual Berbasis Private Cloud Dengan Model Layanan IAAS Sebagai Media Praktikum Jaringan Komputer"
  },
  {
    "abstract": "Kemandirian belajar adalah kesiapan individu untuk belajar dengan inisiatif sendiri, dengan atau tanpa bantuan pihak lain dalam hal penentuan tujuan, metode dan evaluasi hasil belajar. Salah satu model  pembelajaran yang  dapat  digunakan  dalam  upaya meningkatkan kemandirian belajar siswa adalah flipped classroom.Penelitian ini bertujuan mengetahui (1) Apakah terdapat perbedaan kemandirian pada penerapan model pembelajaran Blended Learning dengan strategi Flipped Classroom dengan model pembelajaran konvensional; (2) Apakah terdapat perbedaan hasil belajar siswa pada penerapan model pembelajaran Blended Learning dengan strategi Flipped Classroom dengan model pembelajaran konvensional (3) Apakah terdapat peningkatan kemandirian pada penerapan model pembelajaran Blended Learning dengan strategi Flipped Classroom dengan model pembelajaran konvensional; (4) Apakah terdapat peningkatan hasil belajar siswa pada penerapan model pembelajaran Blended Learning dengan strategi Flipped Classroom dengan model pembelajaran konvensional.Model desain pretest-posttest control group design diterapkan dalam penelitian ini, yang menggunakan metode quasi eksperimental design. Partisipan dalam penelitian ini adalah siswa kelas X Multimedia 1 dan X Multimedia 2 SMK Negeri 1 Gondang. Jumlah siswa yang digunakan dalam penelitian ini sebanyak 70 orang. Total sampling digunakan sebagai metode sampling. Pretests, posttests, dan kuesioner digunakan untuk mengumpulkan data. Uji keseimbangan, uji normalitas, uji homogenitas, dan uji hipotesis termasuk di antara prosedur analisis data yang digunakan. Hasil penelitian mengungkapkan bahwa model pembelajaran Blended Learning dengan strategi flipped classroom berdampak pada kemandirian dan hasil belajar siswa. ",
    "id": 5,
    "title": "Pengaruh Model Pembelajaran Blended Learning Dengan Strategi Flipped ClassroomTerhadap Kemandirian Dan Hasil Belajar Pada Mata Pelajaran Simulasi Digital Siswa Kelas X Di SMK Negeri 1 Gondang"
  },
  {
    "abstract": "Teknologi IoT berkembang pesat dengan cepat. Teknologi IoT seluruhnya diterapkan pada seluruh bidang kehidupan manusia termasuk bidang pendidikan. Dalam dunia pendidikan, IoT merupakan sebuah sistem yang memungkinkan untuk meningkatkan kemudahan dalam proses belajar mengajar, contohnya penerapan teknologi IoT adalah pada smart clasrooms.Literatur terbaru menyatakan bahwa Konsep Internet of Things (IoT) mampu memainkan peran penting dalam meningkatkan aspek cerdas yang sudah diterapkan di bidang pendidikan. Makalah ini bertujuan untuk mensurvei implementasi terbaru dari sistem pemantauan berbasis IoT yang diterapkan di bidang pendidikan. Makalah ini  merekomendasikan  strategi  untuk  mengadopsi  alat  pemantauan  berbasis  IoTterkait dengan penerapan sistem irigasi di Indonesia. Kata kunci: agriculture monitoring systems, drip irrigation system, internet ",
    "id": 6,
    "title": "Evaluasi Sistem Monitoring pada Perangkat Drip Irrigation System untuk Pembelajaran Internet of Things"
  },
  {
    "abstract": "Herman Sanjaya. K3515028. THE EFFORTS TO IMPROVE STUDENTS’ LEARNING RESULTS AND PARTICIPATION THROUGH EDMODO-ASSISTED BLENDED LEARNING MODEL IN THE NETWORK SERVICE TECHNOLOGY COURSE OF CLASS XI TKJ 2 IN SMK NEGERI 1 BANYUDONO. Undergraduate Thesis, Surakarta: Faculty of Teacher Training and Education, Universitas Sebelas Maret Surakarta, September 2019. The research aims to improve the learning results and participation of the students of class XI TKJ 2 SMK Negeri 1 Banyudono in the Network Service Technology through the application of Edmodo-assisted Blended Learning Model.This is a classroom action research (CAR). This research was conducted in two cycles consisting of four stages, namely: the planning stage, the implementation stage, the observation stage, and the reflection stage. The subjects of this research were 34 students of class XI TKJ 2 SMK Negeri 1 Banyudono. The data were collected by tests, observations, interviews, and documentation techniques. The data were then validated using triangulation technique. Then, the data were analyzed using quantitative descriptive analysis model.The results showed that the application of Edmodo-assisted blended learning model could improve the learning result of Network Service and Technology course of the students of class XI TKJ 2 SMK Negeri 1 Banyudono. The improvement was proven by the increasing cognitive and participation score of the students in every cycle. In the pre-action, the average score of students’ cognitive learning result was 66.618 with a completeness percentage of 47.05%, and the students’ participation percentage was 61.02%. In cycle I, the average score of students’ cognitive learning result was 89.853 with a completeness percentage of 94.11%, and the students’ participation percentage was 73.94%. Those numbers have reached the achievement target, but there were still several indikators which have not reached the target. In cycle I, the average score of students’ cognitive learning result was 91.912 with a completeness percentage of 94.11%, and the students’ participation percentage was 84.76%, in which it has reached the target indikator, where each indikator has reached a limit of 70%. This research concluded that the application of Edmodo-assisted blended learning model could improve the cognitive learning and participation of Network Service and Technology course of students of class XI TKJ 2 SMK Negeri 1 Banyudono.",
    "id": 7,
    "title": "Upaya Meningkatkan Hasil Belajar dan Keaktifan Siswa Melalui Model Pembelajaran Blended Learning dengan Berbantukan Edmodo Mada Mata Pelajaran Teknologi Layanan Jaringan Kelas XI TKJ 2 di SMK Negeri 1 Banyudono"
  },
  {
    "abstract": "Pembelajaran daring di Sekolah Menengah Kejuruan (SMK) di Indonesia menimbulkan banyak permasalahan baru dalam pelaksanaanya seperti rendahnya tingkat motivasi dan minat belajar siswa dalam pembelajaran, kurangnya tingkat kehadiran siswa dalam pembelajaran, tingkat pemahaman siswa masih kurang kondisi siswa tersebut menyebabkan capaian kompetensi dalam pembelajaran kurang memuaskan. Untuk mengatasi permasalahan tersebut guru dapat mengupayakan beberapa cara yang dapat digunakan seperti salah satunya menggunakan variasi metode dan pendekatan pembelajaran seperti metode STEAM dengan pendekatan konstruktivisme. Setiap elemen dalam STEAM bertujuan untuk meningkatkan kreativitas, inovasi, dan minat, mempromosikan keterampilan pemecahan masalah dan minat kognitif lainnya. Pendekatan konstruktivisme membuat siswa lebih dominan dalam pembelajaran mereka sendiri. Temuan dalam penelitian ini adalah sebuah prosedur pembelajaran daring menggunakan metode STEAM dan pendekatan konstruktivisme yang diekslporasi untuk dapat meningkatkan aspek kemampuan siswa dalam pembelajaran. Metode penelitian yang digunakan dalam penelitian ini adalah wawancara dan observasi yang terbagi kedalam tiga tahapan. Data awal didapatkan menggunakan wawancara dengan guru dan partisipan, kemudian pada proses penelitian data dikumpulkan melalui pengamatan observasi selama kegiatan pembelajaran, dan yang terakhir evaluasi yang dilakukan dengan wawancara refleksi terkait pembelajaran. STEAM diintegrasikan kedalam rencana pelaksanaan pembelajaran desain grafis menggunakan tahapan integrasi STEAM pembelajaran berbasis proyek yang kemudian digabungkan dan diimplementasikan dengan tahapan pendekatan pembelajaran konstruktivisme. Data yang terkumpul kemudian dilakukan reduksi data, disajikan dan dianalisis untuk kemudian dapat ditarik kesimpulan dan hasil. Hasil penelitian yang didapatkan antara lain (1) prosedur pelaksanaan pembelajaran desain grafis terintegrasi STEAM berbantuan pendekatan konstruktivisme yang terdiri dari enam tahapan pembelajaran yang meliputi situation yang meliputi menciptakan situasi yang menggambarkan materi pembelajaran sesuai dengan topik pembahasan, question meliputi pemberian pertanyaan essensial kepada siswa, bridge meliputi diskusi identifikasi masalah, perencanaan perancangan proyek dan penyusunan jadwal, grouping & monitoring meliputi pemberian masalah sederhana serta pengelompokan partisipan dalam kelompok kecil yang kemudian diawasi setiap kegiatanya, presentation meliputi penyajian hasil dan penilaian hasil proyek, dan evaluation yang meliputi evaluasi pengalaman partisipan melalui refleksi wawancara. (2) pembelajaran terintegrasi STEAM berbantuan pendekatan konstruktivisme menghasilkan adanya beberapa peningkatan aspek prestasi siswa seperti aspek sikap dan keterampilan dalam pembelajaran.Kesimpulan dari penelitian ini menunjukan bahwa pembelajaran menggunakan metode STEAM dengan pendekatan konstruktivisme dalam pembelajaran berbasis proyek yang dilaksanakan secara daring berhasil meningkatkan kemampuan siswa dalam dua aspek yaitu aspek sikap dan aspek keterampilan selain itu adanya penggunaan metode STEAM dan pendekatan konstruktivisme mampu menciptakan lingkungan belajar yang menyenangkan dan dapat dengan mudah diterima oleh para siswa. ",
    "id": 8,
    "title": "Integrasi STEAM (Science, Technology, Engineering, Art, Mathematics) dengan Kompetensi Dasar Mata Pelajaran Desain Grafis Menggunakan Pendekatan Konstruktivisme pada Siswa SMK"
  },
  {
    "abstract": "Penelitian ini bertujuan untuk menguji ada tidaknya (1) Perbedaan hasil belajar antara penerapan model pembelajaran kooperatif tipe TGT berbantuan aplikasi Quizizz dan model pembelajaran konvensional; (2) Perbedaan hasil belajar antara siswa yang memiliki motivasi belajar kategori tinggi dan rendah; (3) Interaksi antara penerapan model pembelajaran kooperatif tipe TGT berbantuan aplikasi Quizizz dan motivasi belajar terhadap hasil belajar.     Model yang digunakan dalam penelitian ini adalah metode eksperimen dengan desain faktorial 2X2 (AXB). Populasi penelitian adalah seluruh siswa kelas X SMK Negeri 6 Surakarta. Pengambilan sampel diambil secara acak (cluster random sampling) sehingga didapatkan 2 kelas, kelas X MM 1 terdiri dari 32 siswa dengan perlakuan pembelajaran konvensional sebagai kelompok kontrol dan kelas X MM 2 terdiri dari 32 siswa dengan perlakuan pembelajaran kooperatif tipe TGT berbantuan aplikasi Quizizz sebagai kelompok eksperimen. Teknik pengumpulan data penelitian ini menggunakan kuesioner dan tes. Analisis data yang digunakan adalah analisis variansi dua jalan dengan isi sel tidak sama.     Berdasarkan penelitian ini, dapat disimpulkan sebagai berikut: (1) Terdapat perbedaan hasil belajar antara penerapan model pembelajaran kooperatif tipe TGT berbantuan aplikasi Quizizz dan model pembelajaran konvensional berdasarkan hasil belajar siswa (Sig. = 0,000 <0 xss=removed xss=removed>Kata Kunci: Kooperatif, TGT, Motivasi Belajar, Hasil Belajar.",
    "id": 9,
    "title": "Pengaruh penerapan model pembelajaran cooperative learning tipe teams games tournament (TGT) berbantuan aplikasi quizizz terhadap hasil belajar ditinjau dari motivasi belajar pada mata pelajaran simulasi digital"
  },
  {
    "abstract": "Permasalahan yang terjadi dalam mempelajari bahasa isyarat Indonesia, khususnya untuk di daerah Solo yaitu jarangnya pembukaan kelas bahasa isyarat untuk umum dan penggunaan media pembelajaran yang terbatas seperti penggunaan powerpoint dan gambar materi bahasa isyarat pada kertas. Tujuan dari penelitian ini adalah mengembangkan sebuah aplikasi media pembelajaran bahasa isyarat berbasis Android dan menguji tingkat kelayakan aplikasi media pembelajaran bahasa isyarat yang telah dikembangkan Penelitian ini menggunakan dengan metode penelitian dan pengembangan dengan model pengembangan ADDIE. Proses pada model ADDIE, yaitu analisis (analysis), perancangan (design), pengembangan (develop), implementasi (implementation) dan evaluasi (evaluation). Penelitian ini berpusat pada uji kelayakan dari aplikasi media pembelajaran dengan menggunakan indikator-indikator pada Standar ISO 25010 yang digunakan untuk menguji kelayakan software. Aspek yang diuji yaitu aspek functional suitability, aspek usability, aspek portability dan validasi oleh ahli materi dan ahli media. Hasil dari penelitian ini adalah sebuah aplikasi media pembelajaran bahasa isyarat berbasis Android. Hasil dari uji kelayakan yang didapatkan, untuk uji functional suitability 100%, uji usability 83.2%, uji portability 100%, uji ahli materi mendapatkan nilai 100?n uji ahli media mendapatkan nilai 93?n dapat disimpulkan aplikasi media pembelajaran bahasa isyarat “sangat layak” digunakan. Kata Kunci : Bahasa Isyarat, ADDIE, Bisindo ",
    "id": 10,
    "title": "Pengembangan Aplikasi Media Pembelajaran untuk Pembelajaran Bahasa Isyarat Berbasis Android"
  },
  {
    "abstract": "Penelitian ini bertujuan untuk mengembangkan sebuah sistem informasi manajemen kegiatan pembelajaran berbasis web yang dapat digunakan untuk manajemen data kurikulum dan pembelajaran serta menguji kelayakan dari sistem informasi yang dikembangkan.Penelitian ini dilaksanakan di Sekolah Haji dan Umrah Baitullah Rubaiyat. Metode yang digunakan adalah metode Penelitian dan Pengembangan dimana peneliti menggunakan metode pengembangan waterfall untuk mengembangkan sistem dan Uji Kelayakan menggunakan Stadart ISO 25010 yang memiliki 8 aspek. Namun pada penelitian ini peneliti hanya menggunakan 4 aspek yaitu functional suitability, performance, portability dan usability. Pengujian dilakukan menggunakan 2 metode yaitu Black Box dan menggunakan instrument dari USE Questionnaire. Metode Black Box digunakan untuk menguji 3 aspek dari ISO yaitu functional suitability, performance, dan portability, pengujian Black Box dilakukan dengan cara manual untuk menguji  functional dan portability dan menggunakan bantuan alat GT Matrix untuk menguji performance  dari sistem yang digunakan. Untuk uji kelayakan dari user atau aspek usability menggunakan menggunakan angket Use Questionnaire oleh Arnold M.Lund (2001). Pengujian angket dilakukan setelah sistem berhasil dipasang dan diterapkan. Pada pengujian ini menggunakan 10 responden yang terdiri dari setiap aktor yang dapat mengoprasikan sistem yaitu administrator, pengajar dan peserta didik.Berdasarkan hasil pengujian yang dilakukan dapat diambil kesimpulan bahwa sistem informasi manajemen kegiatan pembelajaran dapat mempermudah berjalannya kegiatan manajemen pembelajaran pada sekolah Haji dan Umrah Baitullah Rubaityat baik dari pelaksanaan administrasi sampai dengan proses pembelajaran. Hasil pengujian kelayakan sistem menunjukan bahwa pengembangan Sistem Informasi Manajemen Kegiatan Pembelajaran Berbasis Web yang dikembangkan memiliki nilai 80,49?ngan Use Quetionnaire dan lolos pada Uji Blackbox. Sehingga dapat disimpulkan bahwa Sistem Informasi Manajemen Kegiatan Pembelajaran ini sangat layak untuk digunakan.Kata Kunci : sistem informasi, manajemen pembelajaran, berbasis web , USE Quetionnaire, Black Box testing",
    "id": 11,
    "title": " Pengembangan sistem informasi manajemen kegiatan pembelajaran berbasis web untuk sekolah haji dan umroh  Baitullah Rubaiyat"
  },
  {
    "abstract": "Penelitian ini dilakukan bertujuan untuk memperoleh gambaran kesiapan siswa smp dalam menerima pembelajaran pemrograman. Dalam penelitian ini dilakukan analisa dengan melihat kemampuan computational thinking (CT) yang ditampilkan siswa selama kegiatan. Metode pendekatan yang digunakan adalah kualitatif deskriptif yang dilakukan pada siswa Madrasah Tsanawiyah Negeri Surakarta 1 kelas 7 Fullday 3. Hasil yang diperoleh menunjuk bahwa siswa setidaknya mampu menampilkan sedikit kemampuan CT. Perbedaan kemampuan CT yang ditampilkan oleh masing-masing siswa dapat menjadi dasar pertimbangan dalam menyususn pembelajaran pemrograman yang sesuai. Dengan mengetahui tingkat kemampuan CT, dapat dperoleh kesiapan pembelajaran pemrograman siswa. Pembelajaran pemrograman dapat disesuaikan pada kesiapan siswa, sehingga kemampuan-kemampuan yang dirasa kurang dapat ditingkatkan terlebih dahulu sebelum memulai pembelajaran pemrograman.Kata Kunci: Pendidikan tingkat menengah; kemampuan abad ke-21; strategi pembelajaran/pengajaran",
    "id": 12,
    "title": "Analisis kesiapan pembelajaran pemrograman pada siswa Madrasah Tsanawiyah Negeri Surakarta 1 berdasarkan kemampuan berpikir komputasi"
  },
  {
    "abstract": "ABSTRAKPenelitian ini bertujuan untuk meningkatkan pemahaman membaca algoritma siswa pada mata pelajaran pemrograman dasar, terutama pada kompetensi dasar struktur kontrol cabang dengan menggunakan model pembelajaran SQ6R (Survey, Question, Read, Reflect, Review, Rehash, Rethink, Reevaluate). Penelitian dimulai dengan mengidentifikasi masalah yang terjadi di kelas. Kemudian merancang suatu tindakan untuk mengatasinya dalam suatu siklus tindakan. Dalam penelitian ini administrasi tindakan berlangsung dalam 2 siklus. Setiap siklus terdiri dari tahapan perencanaan, pelaksanaan, pengamatan, dan refleksi. Teknik pengumpulan data dilakukan melalui tes pemahaman membaca siswa. Analisis data dilakukan dengan menggunakan analisis kuantitatif dan kualitatif. Hasil penelitian menunjukkan bahwa model pembelajaran SQ6R dapat meningkatkan pemahaman membaca algoritma siswa. Hal ini ditunjukkan oleh persentase ketuntasan hasil tes pemahaman membaca siswa sebesar 38,9% pada pra siklus, 47,2% pada siklus 1 dan 83,3% pada siklus 2.Kata Kunci : Model Pembelajaran, SQ6R, Pemahaman Algoritma ",
    "id": 13,
    "title": "Penerapan Model Pembelajaran Sq6r  Untuk Meningkatkan Pemahaman Algoritma Pada Mata Pelajaran Pemrograman Dasar Di Kelas X Tkj 1 Smk Negeri 1 Sawit Boyolali"
  },
  {
    "abstract": "Penelitian ini bertujuan untuk mengetahui kesesuaian komponen game edukatif yang beredar di Google Play Store ditinjau dari  (1) sudut pandang elemen-elemen yang terkandung dalam gamifikasi?; (2) konten game dengan kurikulum yang berlaku dalam pembelajaran berhitung untuk tingkat awal sekolah dasar tingkat rendah (kelas 1-3 SD).Data penelitian ini berwujud kumpulan game edukatif yang terkait dengan tema penelitian, yaitu mengenai pembelajaran berhitung yang dikumpulkan melalui observasi dengan pencarian di Google Play Store, yaitu pasar aplikasi berbasis android, yang kemudian hasilnya di seleksi berdasarkan kata kunci yang terkait dan memiliki relevansi dengan unsur gamifikasi dan kesesuaian kurikulum di Indonesia dengan konten game-nya.Hasil penelitian adalah sebagai berikut ini. Pertama, kesesuaian komponen game berhitung untuk SD kelas rendah (1-3) masih cukup rendah dari sisi gamifikasi. Rata-rata skor keseluruhan adalah 0.49. Aspek paling banyak terpenuhi adalah aspek Rintangan (terdapat dalam elemen Dinamika) dan Progress (terdapat dalam elemen Dinamika), keduanya memiliki skor rata-rata pemenuhan sebesar 0.99, dan aspek yang paling banyak tidak terpenuhi adalah aspek Kerjasama (terdapat dalam elemen Mekanika) dan Tim (terdapat dalam elemen Komponen) yang memiliki skor rata-rata pemenuhan sebesar 0. Kedua, Kesesuaian komponen game berhitung untuk SD kelas rendah (1-3) juga cukup rendah dari sisi kurikulum. Rata-rata skor keseluruhan adalah 0.40. Aspek yang paling banyak terpenuhi adalah aspek Bilangan yang memiliki skor rata-rata pemenuhan sebesar 0.98, dan aspek yang paling banyak tidak terpenuhi adalah aspek Statistika yang memiliki skor rata-rata pemenuhan sebesar 0.05. ",
    "id": 14,
    "title": "Studi Evaluasi Terhadap Game Edukatif untuk Pendidikan SD (Kelas Rendah) Dalam Pembelajaran Berhitung Ditinjau dari Aspek Gamifikasi dan Kurikulum"
  },
  {
    "abstract": "Penelitian ini bertujuan untuk mengetahui (1) manakah yang menghasilkan prestasi belajar yang lebih baik antara model pembelajaran kooperatif tipe think talk write (TTW) atau model pembelajaran konvensional; (2) manakah yang menghasilkan prestasi belajar yang lebih baik, siswa dengan gaya belajar visual, siswa dengan gaya belajar auditorial atau siswa dengan gaya belajar kinestik; (3) pada masing-masing penerapan model pembelajaran kooperatif tipe think talk write (TTW) atau model pembelajaran konvensional yang menghasilkan prestasi belajar lebih baik siswa dengan gaya belajar visual, auditorial atau kinestik; (4) pada masing-masing kategori gaya belajar yang menghasilkan prestasi belajar lebih baik penggunaan model pembelajaran kooperatif tipe think talk write (TTW) atau model pembelajaran konvensional. Sampel yang terpilih adalah 72 peserta didik kelas X tahun ajaran 2017/2018.Penelitian ini menggunakan jenis penelitian kuantitatif deskriptif. Pengumpulan data dilakukan dengan penyebaran angket dan dokumentasi. Analisis data menggunakan Analisis variansi dua arah dengan sel tak sama. Hasil penelitian yang diperoleh menjelaskan bahwa (1) pembelajaran dengan pendekatan TTW menghasilkan prestasi yang lebih baik jika dibanding dengan pendekatan konvensional pada materi bahasan perakitan komputer (2) Gaya belajar siswa visual, auditorial maupun kinestetik tidak memberikan perbedaan prestasi belajar perakitan komputer (3) Tidak ada interaksi yang signifikan antara pendekatan pembelajaran dan gaya belajar siswa terhadap prestasi belajar perakitan komputer. Siswa, yang mengikuti pembelajaran dengan pendekatan TTW mempunyai prestasibelajar lebih baik dari pada siswa yang mengikuti pembelajaran dengan pendekatan konvensional baik pada siswa yang memiliki gaya belajar visual, auditorial maupun kinestetik.",
    "id": 15,
    "title": "Perbedaan Prestasi Belajar Ditinjau dari Gaya Belajar pada Penerapan Model Pembelajaran Kooperatif Tipe Think Talk Write (TTW) di SMK Negeri 1 Sawit"
  },
  {
    "abstract": "Penelitian ini bertujuan untuk mengetahui ada tidaknya (1) perbedaan prestasi belajar antara siswa yang mendapat model pembelajaran konvensional dengan model pembelajaran u-learning; (2) perbedaan prestasi belajar antara siswa yang memiliki motivasi belajar tinggi, sedang dan rendah; dan (3) pengaruh interaksi antara model pembelajaran dengan motivasi belajar terhadap prestasi belajar. Penelitian ini menggunakan metode penelitian eksperimen.Penelitian ini merupakan jenis penelitian eksperimen. Populasi dalam penelitian ini yaitu seluruh siswa kelas X TKJ SMK Yapek Gombong. Sampel yang digunakan yaitu kelas X TKJ 1 yang berjumlah 32 siswa dan kelas X TKJ 2 yang berjumlah 25 siswa. Teknik sampling yang digunakan yaitu teknik simple random sampling.  Teknik  pengumpulan  data menggunakan  metode kuesioner,  tes  dan dokumentasi. Teknik analisis data yang digunakan yaitu uji keseimbangan, uji normalitas dan uji homogenitas dengan taraf signifikansi 5% serta uji hipotesis menggunakan uji –t dan uji anava dua jalan dengan sel tak sama.Hasil penelitian adalah sebagai berikut. Pertama, terdapat perbedaan prestasi belajar antara siswa yang mendapat model pembelajaran konvensional dengan model u-learning. Pembelajaran dengan model u-learning memberikan prestasi belajar yang lebih baik dibandingkan pembelajaran dengan model konvensional, karena dengan pembelajaran u-learning memudahkan bagi siswa untuk memahami kembali materi pelajaran dan menjadikan siswa lebih aktif pada saat pembelajaran berlangsung yang berdampak pada prestasi belajar siswa. Kedua, terdapat perbedaan prestasi belajar antara siswa yang memiliki motivasi belajar tinggi, sedang dan rendah. Siswa dengan motivasi belajar tinggi memiliki prestasi belajar yang lebih baik dibandingkan dengan siswa yang motivasi belajarnya sedang dan rendah. Sedangkan siswa dengan prestasi belajar sedang juga memiliki prestasi belajar yang lebih baik dibandingkan siswa dengan prestasi belajar rendah. Ketiga, terdapat pengaruh interaksi antara model pembelajaran dengan motivasi belajar terhadap prestasi belajar.",
    "id": 16,
    "title": "Studi Komparasi Antara Model Pembelajaran Konvensional dengan Model Ubiquitous Learning (U-Learning) Terhadap Prestasi Belajar Ditinjau dari Motivasi Belajar Siswa pada Mata Pelajaran Simulasi dan Komunikasi Digital Kelas X SMK Yapek Gombong"
  },
  {
    "abstract": "Penelitian ini bertujuan untuk mengetahui (1) pengaruh persepsi siswamengenai kompetensi pedagogik guru terhadap prestasi belajar siswa pada matapelajaran sistem komputer; (2) pengaruh persepsi siswa mengenai kompetensikepribadian guru terhadap prestasi belajar siswa pada mata pelajaran sistemkomputer; (3) pengaruh persepsi siswa mengenai kompetensi sosial guru terhadapprestasi belajar siswa pada mata pelajaran sistem komputer; (4) pengaruh persepsisiswa mengenai kompetensi profesional guru terhadap prestasi belajar siswa padamata pelajaran sistem komputer; (5) pengaruh persepsi siswa mengenaikompetensi pedagogik guru, kompetensi kepribadian guru, kompetensi sosialguru, dan kompetensi profesional guru secara bersama – sama terhadap prestasibelajar siswa pada mata pelajaran sistem komputer.Populasi dalam penelitian ini adalah siswa kelas X dan XI jurusan TKJ diSMK Negeri 1 Banyudono. Penelitian ini merupakan penelitian kuantitatif denganmetode survei. Pengumpulan data menggunakan metode angket dan dokumentasi.Analisis data menggunakan regresi ganda.Hasil penelitian ini adalah sebagai berikut ini. Pertama, tidak terdapatpengaruh yang positif dan signifikan persepsi siswa mengenai kompetensipedagogik guru terhadap prestasi belajar siswa pada mata pelajaran sistemkomputer di SMK Negeri 1 Banyudono. Kedua, tidak terdapat pengaruh yangpositif dan signifikan persepsi siswa mengenai kompetensi kepribadian guruterhadap prestasi belajar siswa pada mata pelajaran sistem komputer di SMKNegeri 1 Banyudono. Ketiga, tidak terdapat pengaruh yang positif dan signifikanpersepsi siswa mengenai kompetensi sosial guru terhadap prestasi belajar siswapada mata pelajaran sistem komputer di SMK Negeri 1 Banyudono. Keempat,terdapat pengaruh yang positif dan signifikan persepsi siswa mengenaikompetensi profesional guru terhadap prestasi belajar siswa pada mata pelajaransistem komputer di SMK Negeri 1 Banyudono. Kelima, terdapat pengaruh yangpositif dan signifikan persepsi siswa mengenai kompetensi pedagogik guru,kompetensi kepribadian guru, kompetensi sosial guru, dan kompetensi profesionalguru secara bersama – sama terhadap prestasi belajar siswa pada mata pelajaransistem komputer di SMK Negeri 1 Banyudono.Kata Kunci: persepsi siswa, kompetensi guru, prestasi belajar siswa ",
    "id": 17,
    "title": "Pengaruh persepsi siswa mengenai kompetensi guru terhadap prestasi belajar siswa pada mata pelajaran sistem komputer di smk negeri 1 Banyudono"
  },
  {
    "abstract": "Penelitian ini bertujuan untuk mengembangkan aplikasi English for Disability (EFORD) yaitu media pembelajaran bahasa Inggris berbasis Android untuk siswa kelas VII Tunanetra SMPLB YKAB Surakarta dan mengetahui tingkat kelayakan aplikasi English for Disability (EFORD) berdasarkan penilaian ahli materi, ahli media, praktisi pembelajaran dan siswa.Metode penelitian yang digunakan dalam penelitian ini adalah Penelitian dan Pengembangan (Research and Development), langkah-langkah pengembangan aplikasi English for Disability (EFORD) dilakukan dalam beberapa tahap meliputi mencari potensi dan masalah, pengumpulan data, desain produk, validasi desain dan uji coba produk. Perancangan aplikasi English for Disability (EFORD) berbasis Android untuk anak tunanetra melalui 5 tahap yaitu: (1) Analisis permasalahan, melalui observasi dan wawancara. (2) Mengumpulkan informasi sebagai bahan perencanaan produk/analisis kebutuhan media sesuai kebutuhan anak tunanetra. (3) Tahap desain produk berupa pembuatan alur peta navigasi dan storyboard. (4) Tahap validasi desain berupa penilaian dari ahli terhadap media yang dikembangkan. (5) Tahap uji coba produk berupa penilaian aplikasi oleh siswa tunanetra.Penelitian ini menghasilkan aplikasi EFORD yang layak digunakan sebagai media pembelajaran bahasa Inggris dengan tingkat kelayakan media EFORD ini berdasarkan penilaian: 1) Ahli media diperoleh persentase skor 95% termasuk dalam kategori “ Sangat Layak”, 2)Ahli materi, diperoleh persentase skor 75%, termasuk dalam kategori “Layak” dan 3) Praktisi pembelajaran, diperoleh persentase skor 83%, termasuk kategori “Sangat Layak”. Respon siswa terhadap media ini menunjukan respon positif dengan mendapatkan persentase ≥ 70% pada setiap indikatornya. Oleh karena itu, media pembelajaran bahasa Inggris dengan aplikasi EFORD berbasis Android ini sangat layak digunakan sebagai media pembelajaran bahasa Inggris pada materi grammar dan speaking english untuk siswa tunanetra kelas VII SMPLB YKAB Surakarta.Kata Kunci : media pembelajaran, aplikasi mobile, Android",
    "id": 18,
    "title": "Pengembangan Media Pembelajaran Berbasis Android, “English for Disability” pada Materi Grammar & Speaking English Untuk Siswa Kelas VII Tunanetra SMPLB YKAB Surakarta"
  },
  {
    "abstract": "Penelitian ini bertujuan untuk : 1) Menghasilkan rancangan produk job sheet interaktif perawatan PC untuk kelas X TKJ di SMK, dan 2) Mengetahui tingkat kelayakan dari job sheet interaktif perawatan PC. Metode penelitian yang digunakan adalah Research and Development yang mengacu pada prosedur pengembangan Borg and Gall. Penelitian ini meliputi 5 tahap yaitu analisis potensi dan masalah, pengumpulan data, desain produk, validasi desain dan perbaikan desain. Validasi desain dilaksanakan oleh ahli media, ahli materi dan pengguna. Validasi desain pengguna dilaksanakan dua kali yaitu, pertama penilaian pengguna (terbatas) yang terdiri dari satu guru produktif dan 3 siswa kelas X TKJ dan penilaian pengguna (diperluas) dilaksanakan oleh 32 siswa kelas X TKJ 1. Penilaian pengguna (diperluas) dilaksanakan setelah melaksanakan perbaikan sesuai dari hasil penilaian ahli media, ahli materi dan penilaian pengguna (terbatas).Penelitian ini menggunakan teknik pengumpulan data wawancara, angket dan dokumentasi. Sedangkan teknik analisis data dilaksanakan dengan cara deskriptif kualitatif dari data kuantitatif untuk pengembangan job sheet interaktif perawatan PC. Hasil penelitian dan pengembangan ini menunjukan bahwa: 1) Dihasilkan rancangan produk job sheet interaktif yang dikembangkan menggunakan software Adobe Flash CS6 Profesional. 2) Hasil rerata penilaian tingkat kelayakan job sheet interaktif oleh ahli materi adalah 88% masuk pada kategori sangat layak, rerata penilaian dari ahli media sebesar 83% masuk pada kategori sangat layak, penilaian pengguna (terbatas) dengan rerata penilaian sebesar 97% masuk pada kategori sangat layak dan penilaian pengguna (diperluas) dengan rerata penilaian sebesar 83% masuk pada kategori sangat layak. Kata kunci : pengembangan, media pembelajaran interaktif, job sheet, SMK, adobe flash.",
    "id": 19,
    "title": "Pengembangan job sheet interaktif menggunakan aplikasi berbasis   komputer pada materi perawatan pc di kelas x tkj  smk negeri 1 Sawit "
  },
  {
    "abstract": "Tujuan penelitian ini adalah untuk mengetahui apakah penerapan project based learning dapat meningkatkan aktivitas dan kompetensi belajar siswa dalam Instalasi Sistem Operasi Berbasis GUI ( Graphical User Interface) dan CLI ( Command Line Interface) kelas X TKJ SMK N 1 Sawit.Penelitian ini menggunakan metode Penelitian Tindakan Kelas (PTK) yang dilaksanakan sebanyak dua siklus dimana masing – masing siklus dilakukan dengan empat tahapan, yaitu : (1) tindakan perencanaan; (2) tindakan pelaksanaan; (3) tindakan observasi; dan (4) refleksi. Subjek penelitian adalah siswa kelas X TKJ 3 di SMK N 1 Sawit sebanyak 34 siswa. Penelitian ini dilaksanakan dengan kolaborasi antara peneliti, guru, observer dan melibatkan partisipasi siswa. Teknik pengumpulan data menggunakan lembar observasi, wawancara, instrumen tes dan teknik analisis data.Berdasarkan hasil penelitian, dapat disimpulkan bahwa penerapan project based learning dapat meningkatkan aktivitas dan kompetensi instalasi sistem operasi berbasis GUI dan CLI. Hal ini terbukti dari fakta – fakta hasil sebagai berikut : (1) Aktivitas siswa dalam mengikuti pembelajaran mengalami peningkatan pada pra siklus sebesar 32,35% menjadi 58,82% pada siklus I dan pada siklus II meningkat menjadi 82,35%. (2) Kompetensi siswa dalam pembelajaran terdisi dari 3 ranah yaitu masing – masing ranah meengalami peningkatan sebagai berikut : (a) Ranah Kognitif dari pra siklus sebesar 11,76% menjadi 26,47% pada siklus I dan siklus II meningkat menjadi sebesar 47,05%. (b) Ranah Afektif dari pra siklus sebesar 32,35% menjadi 53,29% pada siklus I dan pada siklus II meningkat menjadi sebesar 76,47%. (c) Ranah Psikomotorik dari pra siklus sebesar 44,11% menjadi 79,41% pada siklus I dan pada siklus II meningkat menjadi 82,35%.Kata kunci : Project Based Learning, Aktivitas dan Kompetensi, Instalasi Sistem Operasi Berbasis GUI (Graphical User Interface) dan CLI ( Command Line Interface).",
    "id": 20,
    "title": "Penerapan Project Based Learning untuk Meningkatkan Aktivitas dan Kompetensi Instalasi Sistem Operasi Berbasis GUI dan CLI pada Siswa Kelas X TKJ di SMK N 1 Sawit"
  },
  {
    "abstract": "Penelitian ini bertujuan untuk : 1) Menghasilkan produk media pembelajaran interaktif pada mata kuliah teknik animasi 3D di PTIK UNS, dan 2) Mengetahui tingkat kelayakan dari media pembelajaran interaktif pada mata kuliah teknik animasi 3D di PTIK UNS.Metode penelitian yang digunakan adalah Research and Development yang mengacu pada prosedur pengembangan 4D. Penelitian ini meliputi 3 tahap yaitu tahap pendefinisian, tahap perencanaan, tahap pengembangan. Pada tahap pengembangan, validasi dilakukan oleh ahli materi dan ahli media serta terdapat penilaian dari pengguna kelompok kecil dan kelompok luas untuk mengetahui kelayakan pengunaan. Penelitian ini menggunakan teknik pengumpulan data dengan observasi dan wawancara sedangkan untuk teknik analisis data menggunakan deskriptif kualitatif dari data kuantitatif yang deperoleh dari lembar penilaian.Hasil penelitian dan pengembangan adalah: 1) menghasilkan media pembelajaran interaktif dengan menggunakan bahasa pemrograman java dan software Netbeans IDE. 2) Hasil penilaian tingkat kelayakan media pembelajaran interakti dari ahli materi 97% yang dikategorikan sangat layak, ahli materi memberikan penilaian 86%  yang dikategorikan sangat layak, penilaian kelompok kecil 79% dalam kategori layak dan pengguna kelompok luas memberikan penilaian 87% yang dikategorikan sangat layak.Kata Kunci : Pengembangan, Media Pembelajaran Interaktif, Java, Netbeans IDE, Teknik Animasi 3D.",
    "id": 21,
    "title": "Pengembangan Media Pembelajaran Interaktif pada Mata Kuliah Teknik Animasi 3 Dimensi di PTIK UNS dengan Menggunakan Java Netbeans"
  },
  {
    "abstract": "Penelitian ini bertujuan untuk menghasilkan sebuah sistem informasi pengelolaan nilai untuk memudahkan guru dalam mengelola nilai rapor siswa. Sistem informasi ini ditujukan untuk digunakan di Sekolah Menengah Kejuruan (SMK). Sistem informasi ini berbasis web, sehingga dapat diakses oleh guru untuk mengelola nilai dan siswa bisa melihat hasil belajarnya.Metode yang digunakan dalam penelitian ini adalah metode penelitian dan pengembangan (R&D) yang dilaksanakan di SMK Negeri 1 Kudus. Teknik pengumpulan data yaitu melalui wawancara, kuesioner dan dokumentasi. Pengembangan Sistem Informasi Akademik Berbasis Web Sebagai Sistem Pengolahan Nilai Siswa di SMK Negeri 1 Kudus dilaksanakan dengan lima tahap yaitu : (1) Communication merupakan diskusi antara peneliti dengan pihak sekolah tentang pengembangan sistem. (2) Planning merupakan tahap perancangan kebutuhan fungsional, kebutuhan software dan kebutuhan hardware dari sistem yang dikembangkan. (3). Modeling yaitu tahap perancangan sistem yang berfokus pada pemrosesan data. Tahap ini dimulai dengan pembuatan Usecase Diagram, Flowchart, DFD (Data Flow Diagram), ERD (Entity Relationship Diagram), Desain Tabel Basis Data dan Relasinya dan pembuatan Desain Tampilan Sistem. (4) Construction yaitu tahapan pada rancangan yang telah dibuat, di implementasikan ke dalam kode (program). (5) Deployment merupakan tahap pengujian kepada pihak SMK untuk mendapatkan umpan balik tentang kelayakan dan pengembangan sistem yang selanjutnya.Nilai akhir dari penelitian ini adalah 93,1% dari ahli sistem, 85,3% dari  guru dan staf tata usaha dan 82,4% dari siswa, sehingga dapat disimpulkan bahwa sistem ini sangat layak untuk digunakan.Kata Kunci : Sistem Informasi Akademik, berbasis web, pengelolaan nilai siswa",
    "id": 22,
    "title": "Pengembangan Sistem Informasi Akademik Berbasis Web Sebagai Sistem Pengolahan Nilai Siswa di SMK Negeri 1 Kudus"
  },
  {
    "abstract": "Penelitian ini bertujuan untuk menghasilkan sebuah aplikasi yang dapat membantu orang tua dan pihak sekolah dalam hal penyampaian informasi. Aplikasi ini berbasis Web dan SMS (Short Message Service). Aplikasi ini dapat menghubungkan orang tua murid dan sekolah melalui SMS yang dikirim.Penelitian ini dilakukan di SMK Negeri 1 Kudus dengan menggunakan teknik pengumpulan data seperti wawancara, menyebarkan lembar penilaian dan dokumentasi. Model yang digunakan dalam pembuatan Aplikasi Web Berbasis SMS sebagai media penyalur informasi dan komunikasi antara sekolah dengan orang tua siswa adalah Waterfall dengan langkah-langkah sebagai berikut : (1) Communication berupa diskusi awal antara peneliti dengan pihak sekolah. (2) Planning merupakan tahap perancangan kebutuhan software, kebutuhan hardware dan kebutuhan fungsionalitas. (3)Modeling yaitu tahap perancangan aplikasi yang berfokus pada pemrosesan data. Tahap ini dimulai dengan pembuatan Use case Diagram, Flowchart, DFD (Data Flow Diagram), ERD (Entity Relationship Diagram), Desain Tabel dan Relasinya, dan yang terakhir adalah pembuatan Desain Tampilan Aplikasi. (4)Construction yaitu tahap implementasi berdasarkan alur data dan alur aplikasi yang telah dibuat. (5)Deployment merupakan tahap pengujian kepada pihak SMK dengan bimbingan dari peneliti untuk mendapatkan masukan untuk pengembangan aplikasi yang selanjutnya.Hasil dari penelitian ini adalah aplikasi web berbasis SMS yang mampu mempermudah komunikasi antara sekolah dan orang tua siswa dengan hasil pengujian sebagai berikut : Dari ahli sistem 82,4, dari guru dan staf tata administrasi 81,6, dan dari orang tua 79,76. Sehingga dapat disimpulkan bahwa aplikasi ini layak untuk digunakan.Kata Kunci : SMS Gateway, berbasis web, penyalur informasi dan komunikasi, SMS",
    "id": 23,
    "title": "Pembuatan Aplikasi Web Berbasis SMS Sebagai Media Penyalur Informasi dan Komunikasi Antara Sekolah dengan Orang Tua Siswa"
  },
  {
    "abstract": "Penelitian ini bertujuan untuk mengetahui (1) perbedaan hasil belajar antara model pembelajaran flipped classroom berbantuan edmodo dengan pembelajaran konvensional pada mata pelajaran sistem operasi kelas X SMK Negeri 1 Banyudono, (2) efektivitas penggunaan model pembelajaran flipped classroom dalam meningkatkan hasil belajar sistem operasi siswa kelas X SMK Negeri 1 Banyudono.Penelitian ini menggunakan metode quasi eksperimental yaitu eskperimen yang memiliki perlakuan atau eksperimen semu. Penelitian ini dilakukan di SMK Negeri 1 Banyudono. Populasi penelitian ini adalah semua siswa kelas X TKJ SMK Negeri 1 Banyudono dengan banyak siswa pada kelas X TKJ 1 berjumlah 33 siswa dan X TKJ 2 berjumlah 30 siswa. Teknik sampling yang digunakan adalah total sampling. Teknik pengumpulan data menggunakan metode tes dan metode observasi, yaitu tes pada penilaian kognitif dan observasi dalam penilaian afektif dan psikomotorik pada mata pelajaran sistem operasi. Teknik analisis data yang digunakan adalah uji keseimbangan, uji normalitas dan uji homogenitas dengan taraf signifikansi 0,05, dan uji hipotesis dengan mengunakan uji t.Berdasarkan hasil penelitian dapat disimpulkan: (1) terdapat perbedaan hasil belajar antara model flipped classroom berbantuan edmodo dengan pembelajaran konvensional pada mata pelajaran sistem operasi kelas X SMK Negeri 1 Banyudono. Hal ini dibuktikan dari thitung: 2,208 > ttabel: 2,00 (2) penggunaan model pembelajaran flipped classroom berbantuan edmodo lebih efektif daripada pembelajaran konvensional dalam meningkatkan hasil belajar siswa kelas X SMK Negeri 1 Banyudono. Hal ini dibuktikan dari analisis indeks gain dengan nilai gain pada kelas eksperimen sebesar 0,512 dan kelas kontrol sebesar 0,288.Kata kunci: model flipped classroom, edmodo, pembelajaran konvensional, hasil belajar sistem operasi ",
    "id": 24,
    "title": "Perbandingan antara model pembelajaran flipped classroom berbantuan edmodo dengan pembelajaran konvensional terhadap hasil belajar sistem operasi  (eksperimen kelas x smk 1 Banyudono) "
  },
  {
    "abstract": "Penelitian ini bertujuan untuk meningkatkan kompetensi mendiagnosis jaringan yang diukur berdasarkan aspek afektif, kognitif dan psikomotorik melalui pendekatan CTL dengan menggunakan software simulasi Packet Tracer pada siswa kelas XI di SMK Negeri 1 Sawit tahun pelajaran 2015/2016.Bentuk penelitian ini adalah penelitian tindakan kelas (PTK), dilaksanakan dalam 2 siklus. Tiap siklus terdiri dari perencanaan, pelaksanaan, pengamatan dan refleksi. Subjek penelitian adalah siswa kelas XI TKJ 1 SMK Negeri 1 Sawit yang berjumlah 30 siswa, 8 siswa laki – laki dan 22 siswa perempuan. Teknik pengumpulan data yang digunakan adalah observasi, wawancara, tes, dan analisis dokumen. Teknik uji validitas yang digunakan adalah uji validitas ahli dan triangulasi sumber. Teknik analisis yang digunakan adalah teknik deskriptif komparatif dan teknik analisis kritis. Hasil penelitian tindakan kelas ini menunjukkan bahwa kompetensi siswa terhadap materi mendiagnosis jaringan meningkat melalui penerapan pendekatan CTL dan metode simulasi menggunakan software packet tracer. Peningkatan tersebut dapat dibuktikan dengan meningkatnya ketuntasan siswa pada tiap aspek. Pada aspek afektif, 13% atau 4 siswa tuntas pada prasiklus, 20% atau 6 siswa pada siklus 1 dan 100% atau 30 siswa tuntas. Pada aspek kognitif terdapat 26% atau 8 siswa tuntas pada siklus 1, 60% atau 18 siswa pada siklus 1, dan 97% atau 29 pada siklus 2. Pada aspek psikomotorik terdapat 77% atau 24 siswa tuntas pada prasiklus, 87% atau 26 siswa pada siklus 1, dan 100% atau 30 siswa pada siklus 2. Simpulan penelitian ini menunjukkan bahwa dengan penerapan pendekatan CTL dan metode simulasi menggunakan software simulasi packet tracer, dapat meningkatkan kompetensi diagnosis jaringan pada siswa kelas XI di SMK Negeri 1 Sawit tahun pelajaran 2015/2016.Kata kunci: CTL, diagnosis jaringan, kompetensi, simulasi",
    "id": 25,
    "title": "Upaya Peningkatan Kompetensi Diagnosis Jaringan  Melalui Pendekatan Contextual Teaching and Learning (Ctl) dengan Metode Simulasi Menggunakan Software Packet Tracer pada Siswa Kelas XI di SMK N 1 Sawit"
  },
  {
    "abstract": "Tujuan penelitian ini untuk mengembangan media pembelajaran videotutorial yang dapat digunakan untuk media bantu proses pembelajaran pada matapelajaran sistem operasi kelas X MM 1 SMK Negeri 6 Surakarta.Metode penelitian yang digunakan dalam penelitian ini adalah metodeRiset dan Pengembangan, yang berupa pengembangan media pembelajaranberbasis video tutorial dan mengujicobakan media tersebut di kelas X MM 1 SMKNegeri 6 Surakarta. Perancangan dilakukan dengan melalui prosedur analisis,desain, pengembangan, dan uji coba. Rangkaian pengembangan produk dilakukandengan mencakup menentukan materi dan kebutuhan, merancang layout danstoryboard, pengambilan video, screencapturing video, dan editing video, sertauji coba terbatas, uji coba diperluas dan revisi produk. Teknik analisis data yangdigunakan dalam penelitian ini adalah teknik analisis deskriptif dengan mengubahdata hasil rata-rata penilaian interval skor.Hasil penelitian ini menunjukkan bahwa penilaian pakar atau ahli materiyang menyatakan bahwa media pembelajaran video tutorial memenuhi kriteriabaik dengan persentase sebesar 78,7%. Penilaian ahli media terhadap mediapembelajaran video tutorial dengan persentase keseluruhan sebesar 87,5% yangmemenuhi kriteria baik sekali. Penilaian praktisi pembelajaran terhadap mediapembelajaran video tutorial dengan persentase keseluruhan sebesar 83,6% yangmemenuhi kriteria baik sekali. Tanggapan oleh siswa kelas X MM 1 SMK Negeri6 Surakarta memperoleh keseluruhan persentase sebesar 90% yang memenuhikriteria baik sekali. Hasil penelitian dapat disimpulkan bahwa media pembelajaranvideo tutorial yang dikembangkan layak dan dapat digunakan pada prosespembelajaran mata pelajaran sistem operasi kelas X MM SMK Negeri 6Surakarta.Kata Kunci: media pembelajaran, video tutorial, pembelajaran sistemoperasi, multimedia pembelajaran, open source operating system.",
    "id": 26,
    "title": "Pengembangan Media Pembelajaran Video Tutorial pada Mata Pelajaran Sistem Operasi Kelas X Multimedia SMK Negeri 6 Surakarta Tahun Ajaran 2015/2016"
  },
  {
    "abstract": "Penelitian ini bertujuan untuk menguji ada tidaknya (1) perbedaan pengaruh penerapan model pembelajaran Discovery Learning dengan model Project Based Learning yang dikombinasikan teknik College Ball terhadap prestasi belajar peserta didik pada materi Kontrol Percabangan; (2) perbedaan pengaruh minat peserta didik terhadap prestasi belajar Kontrol Percabangan; dan (3) interaksi pengaruh antara penerapan model pembelajaran dengan minat terhadap prestasi belajar peserta didik pada materi Kontrol Percabangan. Populasi dalam penelitian ini adalah seluruh siswa kelas X MM di SMK Negeri 6 Surakarta. Sampel dalam penelitian ini sudah mencakup keseluruhan populasi yaitu kelas X MM 1 dan X MM 2. Penelitian ini menggunakan metode Eksperimen Semu Postest Only Control Group Design. Pengumpulan data dilaksanakan dengan pengambilan angket untuk data minat dan teknik tes untuk data prestasi belajar peserta didik. Analisis data menggunakan uji anava dua jalan dengan model faktorial, kemudian dilanjutkan dengan uji komparasi ganda menggunakan rumus Scheffe dengan taraf signifikansi 0,05. Hasil penelitian adalah sebagai berikut ini. Pertama, tidak ada perbedaan pengaruh yang signifikan antara model Discovery Learning dan model Project Based Learning kombinasi teknik College Ball terhadap prestasi belajar siswa, walaupun tidak terdapat pengaruh yang positif dan signifikan rata-rata nilai prestasi belajar peserta didik dengan model Project Based Learning kombinasi teknik College Ball memiliki nilai rata-rata yang lebih baik dibandingkan dengan siswa yang diberi pembelajaran dengan model Discovery Learning. Kedua, ada perbedaan pengaruh yang signifikan antara minat belajar peserta didik terhadap prestasi belajar peserta didik, dimana minat tinggi memberikan prestasi belajar yang lebih baik daripada minat rendah. Untuk minat belajar peserta didik kategori tinggi dan sedang memberikan pengaruh yang sama terhadap prestasi belajar, hal yang sama juga terjadi pada minat sedang dan rendah. Ketiga, tidak ada interaksi pengaruh antara penerapan model pembelajaran dengan minat peserta didik bersama-sama terhadap prestasi belajar siswa. Kata Kunci : discovery learning, project based learning, college ball, minat, prestasi belajar",
    "id": 27,
    "title": "Eksperimentasi Discovery Learning dan Project Based Learning Kombinasi College Ball ditinjau dari Minat pada Materi Kontrol Percabangan Kelas X SMK Negeri 6 Surakarta Tahun Ajaran 2015/2016"
  },
  {
    "abstract": "Penelitian ini bertujuan untuk mengembangkan modul interaktif pada mata pelajaran simulasi digital dan mengetahui kelayakan modul interaktif berdasarkan penilaian ahli materi, ahli media, dan praktisi pembelajaran. Metode penelitian yang digunakan dalam penelitian ini adalah Penelitian dan Pengembangan (Research and Development). Pengembangan modul interaktif dilakukan dalam beberapa tahap. Tahap pertama yang dilakukan dalam penelitian ini adalah analisis isi materi dan analisis kebutuhan. Tahapan selanjutnya dari penelitian ini adalah pembuatan peta navigasi dan storyboard. Tahapan terakhir adalah pembuatan media, memvalidasi, merevisi, publishing, dan mengujicoba. Hasil penelitian menunjukkan bahwa modul interaktif memiliki skor 97% dari ahli materi yang termasuk dalam kategori sangat layak, 79% dari ahli media yang termasuk dalam kategori layak, dan 97% dari praktisi pembelajaran yang termasuk dalam kategori sangat layak.",
    "id": 28,
    "title": "Pengembangan Modul Interaktif Berbasis Adobe Flash pada Kompetensi Dasar Pengolah Simulasi Visual  Tahap Pasca Produksi Kelas X Akuntansi 3                           SMK Negeri 6 Surakarta"
  },
  {
    "abstract": "Penelitian ini bertujuan untuk mengetahui (1) pengaruh computer literacy terhadap minat mencari kerja pada siswa kelas XII di Sekolah Menengah Kejuruan Kabupaten Wonogiri Tahun Pelajaran 2015/2016; (2) pengaruh intensitas penggunaan website sebagai media informasi terhadap minat mencari kerja pada siswa kelas XII di Sekolah Menengah Kejuruan Kabupaten Wonogiri Tahun Pelajaran 2015/2016; (3) pengaruh computer literacy dan intensitas penggunaan website sebagai media informasi terhadap minat mencari kerja pada siswa kelas XII di Sekolah Menengah Kejuruan Kabupaten Wonogiri Tahun Pelajaran 2015 / 2016. Populasi dalam penelitian ini adalah siswa kelas XII SMK di Kabupaten Wonogiri tahun pelajaran 2015/2016. Penelitian ini merupakan penelitian kuantitatif dengan metode survei. Pengumpulan data menggunakan metode angket dan dokumentasi. Analisis data menggunakan regresi tunggal untuk menguji hipotesis 1 dan 2, dan regresi ganda untuk menguji hipotesis 3. Hasil penelitian ini adalah sebagai berikut ini. Pertama, terdapat pengaruh yang positif dan signifikan computer literacy terhadap minat mencari kerja pada siswa kelas XII di Sekolah Menengah Kejuruan Kabupaten Wonogiri tahun pelajaran 2015/2016 yang ditunjukkan dengan koefisien korelasi (r ) sebesar 0,249, koefisien determinasi (r 2 x1y ) sebesar 0,062 dan t (3,289>1,97) pada taraf signifikansi 5%. Kedua, terdapat pengaruh yang positif dan signifikan intensitas penggunaan website sebagai media informasi terhadap minat mencari kerja pada siswa kelas XII di Sekolah Menengah Kejuruan Kabupaten Wonogiri tahun pelajaran 2015/2016 yang ditunjukkan dengan koefisien korelasi (r x1y ) sebesar 0,316, koefisien determinasi (r 2 x1y ) sebesar 0,100 dan t hitung >t (4,250>1,97), pada taraf signifikansi 5%. Ketiga, terdapat pengaruh yang positif dan signifikan computer literacy dan intensitas penggunaan website sebagai media informasi secara bersama–sama terhadap minat mencari kerja pada siswa kelas XII Sekolah Menengah Kejuruan di Kabupaten Wonogiri dengan koefisien determinasi (R tabel 2 ) sebesar 0,13 dan F hitung >F (12,164>3,05), pada taraf signifikansi 5%",
    "id": 29,
    "title": "Pengaruh Computer Literacy  dan  Intensitas  Penggunaan  Website Sebagai  Media  Informasi   Terhadap  Minat  Mencari  Kerja  pada  Siswa  Kelas XII di Sekolah Menengah Kejuruan Kabupaten Wonogiri  Tahun Pelajaran 2015/2016"
  },
  {
    "abstract": "Penelitian ini bertujuan untuk meningkatkan pemahaman konsep dasaralgoritma pemrograman siswa kelas X TKJ 1 SMK N 1 Banyudono padapembelajaran Pemrograman Dasar melalui model pembelajaran Problem BasedLearning menggunakan aplikasi Robomind.Penelitian ini merupakan Penelitian Tindakan Kelas, dengan subjekpenelitian yaitu siswa kelas X TKJ 1 SMK N 1 Banyudono sejumlah 33 siswa.Penelitian diawali dengan mengidentifikasi masalah yang terjadi di dalam kelas.Kemudian dirancang suatu tindakan untuk mengatasinya dalam sebuah siklustindakan. Pada penelitian ini pemberian tindakan berlangsung dalam dua siklus.Setiap siklus terdiri atas tahap perencanaan, pelaksanaan, pengamatan, danrefleksi.. Teknik pengumpulan data dilakukan melalui observasi kegiatanpembelajaran di kelas dan tes pemahaman setelah tindakan tiap siklusnya. Analisaterhadap data dilakukan menggunakan teknik analisis kuantitatif dan kualitatifinteraktif.Hasil penelitian menunjukan bahwa penerapan model pembelajaranProblem Based Learning menggunakan bantuan media aplikasi Robomind dapatmeningkatkan pemahaman siswa terhadap algoritma program. Hal tersebutditunjukan dengan persentase ketuntasan siswa dalam tes pemahaman sebesar37,5 % pada pra siklus, 44,8 % pada siklus I, dan 93,3 % pada siklus II.Kata Kunci : penelitian tindakan kelas, pemahaman konsep dasar algoritma,problem based learning, robomind ",
    "id": 30,
    "title": "Upaya peningkatan pemahaman konsep dasar algoritma pemrograman menggunakan aplikasi robomind melalui model problem based learning pada mata pelajaran pemrograman dasar siswa kelas x tkj 1 smk n 1 Banyudono"
  },
  {
    "abstract": "ABSTRAKPenelitian  ini  bertujuan  untuk  membuat  media  pembelajaran  Subnettingberbasis web dan mengetahui kelayakan media pembelajaran Subnetting berbasisweb  yang dibuat. Penilaian kualitas media pembelajaran dilihat dari  segi media,materi dan dari segi pengguna.Metode  penelitian  yang  digunakan  adalah  pengembangan  atau  dikenaldengan  metode  Research  and  Development  (R&D).  Model  pengembanganmengacu  pada  Waterfall  model  oleh  Pressman  mengenai  pengembangan  suatuperangkat  lunak.  Pada  tahap  desain  berupa  pembuatan  rancangan  mediapembelajaran antara lain rancangan usecase, rancangan flowchart, rancangan dataflow  diagram  (DFD),  rancangan  entity  relationship  diagram  (ERD),  rancangandatabase,  dan  rancangan  desain. Tahap  Pengujian  yang  dilakukan  dibagi  dalamdua tahap yaitu alpha testing yang dilakukan oleh ahli media dan ahli materi sertabeta  testing  yang  dilakukan  oleh  siswa  kelas  X  TKJ  SMK  Taruna  Kradenan.Instrumen penelitian menggunakan angket tertutup dan angket terbuka. Pengujiandilakukan untuk mengetahui kualitas media pembelajaran yang dikembangkan.Pengembangan  yang  dilakukan  menghasilkan  produk  berupa  mediapembelajaran  Subnetting  berbasis  web.  Proses  pengembangan  terdiri  dari  (1)analisis,  (2)  desain  yang  dibagi  menjadi  2  yaitu  desain  program  dan  desaintampilan,  (3)  implementasi berupa proses koding  (4) pengujian berupa penilaiankualitas media  dan  (5)  proses  perbaikan  dan  perawatan media.  Hasil  penilaiandalam skala likert media pembelajaran yang dikembangkan adalah sebagai berikut:  (1)  Penilaian  ahli  media  menunjukkan  bahwa  website  telah  sesuai  dengankriteria  penilaian,  nilai    akhir    dari   media    pembelajaran  interaktif  adalah  90%dengan  tingkat kelayakan “sangat  layak”.  (2) Total kriteria penilaian dalam  segimateri  terhadap  media  pembelajaran  interaktif  adalah  90%  dengan  tingkatkelayakan “sangat  layak”. (3) Penilaian pengguna yang dilakukan secara 2  tahapyaitu  skala  kecil  dan  skala  besar  secara  langsung  kepada  guru  dan  siswa. Datapenilaian pengguna Skala Kecil yang merupakan hasil penilaian terhadap 2 orangguru dan 5 orang  siswa pada media pembelajaran  subnetting menunjukan angkasebesar  88%  tingkat  kelayakan  “Sangat  layak”.  Berdasarkan  data  penilaian  pengguna    skala  besar  yang merupakan  hasil  penilaian  terhadap  21  siswa  TKJkelas  X  SMK  Taruna  Kradenan  yaitu  menunjukan  presentase  86,7%    tingkatkelayakan  “Sangat  Layak”.  Dengan  demikian  hasil  dari  keseluruhan  penilaiandilihat  pada  tiga  segi  aspek  tersebut,  dapat  disimpulkan  bahwa  mediapembelajaran subnetting berbasis web yang dibangun mempunyai kelayakan yangbaik. Sehingga dapat digunakan sebagai media pembelajaran. Kata Kunci : media pembelajaran, subnetting, berbasis web ",
    "id": 31,
    "title": "Pembuatan Media Pembelajaran Interaktif Berbasis Web dengan Menggunakan Html5 pada Materi Subnetting Kelas X Tkj Smk Taruna Kradenan"
  },
  {
    "abstract": "Penelitian ini bertujuan untuk meningkatkan kompetensi (1) kognitif; (2)psikomotorik; (3) afektif pada mata pelajaran pemrograman dasar setelahmenggunakan model kooperatif tipe STAD berlatar musik klasik;Penelitian ini merupakan penelitian tindakan kelas dengan pelaksanaanselama 2 siklus. Penelitian ini menggunakan model kooperatif tipe STAD denganlatar musik klasik. Subjek penelitian ini adalah seluruh siswa kelas X Multimedia1 di SMK Negeri 3 Surakarta. Penggumpulan data dilakukan dengan teknikobservasi untuk data kompetensi afektif peserta didik, teknik tes untuk datakompetensi kognitif dan psikomotorik, dan teknik angket untuk data efektivitasmusik klasik dalam pembelajaran terhadap ketenangan dan konsentrasi. Analisisdata yang digunakan adalah analisis data diskriptif komparatif.Hasil penelitian sebagai berikut. (1) peningkatan kompetensi kognitif pesertadidik belum mencapai indikator (Pratindakan 0%, Siklus I 18.518%, dan Siklus II10%). (2) peningkatan kompetensi psikomotorik peserta didik mencapai indikator(Pratindakan 33.33%, Siklus I 74.074%, dan Siklus II 76.67%). (3) peningkatanpada kompetensi afektif peserta didik mencapai indikator (Pratindakan 40%,Siklus I 53.125%, dan Siklus II 80%).Kata Kunci: Kompetensi, model kooperatif, Musik Klasik, Pemrograman Dasar,STAD",
    "id": 32,
    "title": "Peningkatan Kompetensi Peserta Didik pada Mata Pelajaran Pemrograman Dasar Menggunakan Model Kooperatif Tipe Stad Berlatar Musik Klasik Kelas X Multimedia 1 SMK Negeri 3 Surakarta"
  },
  {
    "abstract": "Tujuan penelitian ini adalah untuk mengetahui hasil belajar peserta didik pada mata pelajaran Pemrograman Web dengan materi pembuatan formulir halaman web melalui model pembelajaran kooperatif tipe STAD pada peserta didik kelas X RPL A SMK Negeri 2 Karanganyar tahun pelajaran 2015/2016. Penelitian ini adalah Penelitian Tindakan Kelas (PTK) dengan menggunakan model pembelajaran kooperatif tipe STAD (Student Team Achievement Division) dalam mata pelajaran pemrograman web dengan kompetensi dasar menyajikan formulir pada halaman web. Materi pokok yang diajarkan adalah memahami dan menyajikan format formulir pada halaman web. Penelitian ini dilakukan pada bulan Maret hingga Mei 2016 dengan dua siklus. Setiap siklus terdiri atas perencanaan, pelaksanaan tindakan, observasi dan refleksi. Subyek dalam penelitian ini peserta didik kelas X RPL A SMK Negeri 2 Karanganyar tahun pelajaran 2015/2016 berjumlah 36 peserta didik yang terdiri dari 30 orang putra dan 6 orang putri. Pengumpulan data dilakukan dengan menggunakan teknik dokumentasi, teknik wawancara, dan teknik tes tertulis untuk aspek kognitif, aspek psikomotor dan aspek afektif dalam bentuk lembar observasi. Teknik analisis data yang digunakan dalam penelitian ini adalah secara deskriptif komparatif dengan persentase. Peningkatan hasil belajar peserta didik baik dari aspek kognitif, afektif maupun psikomotor dalam pembelajaran pemrograman web dengan menggunakan model pembelajaran kooperatif tipe STAD (Student Team Achievement Division) sebagai berikut 1) Capaian pada aspek kognitif pada observasi awal 33,33%, menjadi 75% pada siklus I dan meningkat menjadi 86,11% pada siklus II. 2) Capaian pada aspek afektif pada observasi awal 61,67%, menjadi 78,68% pada siklus I dan meningkat menjadi 87,01% pada siklus II. 3) Capaian pada aspek psikomotor pada observasi awal 42,16%, menjadi 68,50% pada siklus I dan meningkat menjadi 82,04% pada siklus II. Berdasarkan hasil penelitian dapat disimpulkan bahwa penerapan model pembelajaran kooperatif tipe STAD (Student Team Achievement Division) dapat meningkatkan hasil belajar peserta didik pada materi pokok formulir halaman web mata pelajaran pemrograman web kelas X RPL A SMK Negeri 2 Karanganyar tahun pelajaran 2015/2016",
    "id": 33,
    "title": "Penerapan Model Pembelajaran Kooperatif Tipe STAD untuk Meningkatkan Hasil Belajar Peserta Didik   pada Mata Pelajaran Pemrograman Web  Kelas X RPL A di SMKN 2 Karanganyar"
  },
  {
    "abstract": "Penelitian ini bertujuan untuk membangun aplikasi pembuatan laporan praktikum yang berguna untuk memudahkan siswa dalam membuat laporan praktikum. Aplikasi ini dibuat untuk digunakan di lembaga pendidikan, terutama pada siswa Sekolah Menengah Kejuruan (SMK) yang sering terjun untuk melakukan praktik. Aplikasi ini berbasis web yang langsung terkoneksi dengan guru, sehingga hasil laporan siswa dapat dilihat dan dinilai oleh guru. Metode yang digunakan dalam penelitian ini adalah metode penelitian dan pengembangan (R&D) menggunakan model pengembangan Borg & Gall. Penelitian ini dilaksanakan di SMK Negeri 1 Sawit. Teknik pengumpulan data yaitu melalui wawancara, menyebarkan lembar penilaian dan dokumentasi. Rancang bangun aplikasi pembuatan laporan praktikum berbasis web pada SMK melalui sepuluh tahap yaitu: (1) Potensi dan masalah. (2) Pengumpulan data. (3) Desain produk, berupa membuat rancangan use case diagram, flowchart, DFD, ERD, pembuatan desain tampilan, pembuatan basis data dan pembuatan aplikasi. (4) Validasi desain, berupa pengujian yang dilakukan oleh ahli media. (5) Revisi desain, yaitu revisi dari ahli media. (6) Uji coba produk, berupa pengujian perorangan. (7) Revisi produk, yaitu revisi tahap I. (8) Uji coba pemakaian, berupa pengujian oleh kelompok kecil. (9) Revisi produk, yaitu revisi tahap II. (10) Produk akhir aplikasi, yaitu hasil akhir aplikasi pembuatan laporan praktikum berbasis web pada SMK. Hasil penelitian dari aplikasi pembuatan laporan praktikum mendapatkan nilai dalam bentuk persentase sebesar 89% dari ahli media, 91% dari kelompok kecil dan 81% dari kelompok luas. Sehingga, aplikasi pembuatan laporan praktikum berbasis web pada SMK masuk dalam kategori sangat layak digunakan dalam pembuatan laporan praktikum.",
    "id": 34,
    "title": "Rancang Bangun Aplikasi Pembuatan Laporan Praktikum  Berbasis Web pada SMK"
  },
  {
    "abstract": "Tujuan penelitian ini adalah untuk (1) Mengetahui peningkatan hasil belajar peserta didik Kelas XI RPL B SMK Negeri 2 Karanganyar dengan penerapan model pembelajaran Project Based Learning pada Mata Pelajaran Pemrograman Desktop, (2) Mengetahui peningkatan keaktifan peserta didik Kelas XI RPL B SMK Negeri 2 Karanganyar dengan penerapan model pembelajaran Project Based Learning pada Mata Pelajaran Pemrograman Desktop.Penelitian ini merupakan Penelitian Tindakan Kelas (PTK) yang dilaksanakan dalam 2 siklus, tetapi sebelumnya terlebih dahulu dilaksanakan tahap prasiklus. Setiap siklus terdiri dari 4 tahap yaitu perencanaan, pelaksanaan tindakan, observasi, dan refleksi. Subjek penelitian adalah peserta didik kelas XI RPL B SMK Negeri 2 Karanganyar Tahun Pelajaran 2015/2016 yang terdiri dari 34 peserta didik dengan laki-laki sejumlah 28 peserta didik dan perempuan sejumlah 6 peserta didik. Teknik pengumpulan data yang digunakan adalah dokumentasi, observasi, tes, dan wawancara. Teknik uji validitas data yang digunakan adalah triangulasi dan teknik analisis data yang digunakan adalah statistik deskriptif komparatif.Hasil penelitian membuktikan bahwa penerapan model pembelajaran Project Based Learning dapat meningkatkan hasil belajar dan keaktifan peserta didik. Hasil penelitian menunjukkan peningkatan persentase ketuntasan peserta didik pada ranah kognitif prasiklus 33,33%, siklus I 40,00%, dan siklus II 96,97%; ranah afektif prasiklus 3,03%, siklus I 56,25%, dan siklus II 84,85%; ranah psikomotorik prasiklus 0,00%, siklus I 40,63%, dan siklus II 81,82%; serta keaktifan prasiklus 6,06%, siklus I 50,00%, dan siklus II 93,94%. Hasil wawancara dengan peserta didik menunjukkan bahwa penerapan model pembelajaran Project Based Learning menyenangkan dan membuat peserta didik lebih aktif dalam proses pembelajaran. Simpulan dari penelitian ini adalah penerapan model pembelajaran Project Based Learning pada mata pelajaran Pemrograman Desktop dapat meningkatkan hasil belajar dan keaktifan peserta didik Kelas XI RPL B SMK Negeri 2 Karanganyar Tahun Pelajaran 2015/2016.Kata Kunci : project based learning, pemrograman desktop, hasil belajar, keaktifan, ketuntasan ",
    "id": 35,
    "title": "Penerapan model pembelajaran project based learning (pbl) pada mata pelajaran pemrograman desktop untuk meningkatkan hasil belajar peserta didik kelas xi rpl b smk negeri 2 Karanganyar"
  },
  {
    "abstract": "Tujuan dari penelitian ini adalah untuk mengetahui (1) perbedaan prestasi belajar siswa antara kelas kontrol dengan kelas eksperimen yang diberikan treatment penggunaan e-learning berbasis schoology dengan menggunakan model discovery learning; (2) efektivitas penggunaan e-learning berbasis schoology dengan menggunakan model discovery learning dalam meningkatkan prestasi belajar siswa.Populasi penelitian ini adalah siswa kelas X multimedia SMK Negeri 6 Surakarta. Teknik pengambilan sampel yang digunakan random sampling. Metode penelitian ini menggunakan quasi eksperimental. Teknik pengumpulan data pada penelitian ini menggunakan metode observasi untuk mengetahui pengelolaan pembelajaran sebelum dan sesudah diberikan treatmen penggunaan e-learning berbasis schoology dengan menggunakan model discovery learning. Metode dokumentasi untuk mengetahui daftar nama, jumlah siswa, nilai harian serta bukti penelitian dengan menggunakan pengambilan gambar. Metode tes untuk mengetahui hasil pretest dan posttest. Analisis data yang digunakan uji non parametrik menggunakan mann whitney test dan wilcoxon sign rank test.Berdasarkan hasil penelitian, pertama terdapat perbedaan nilai posttest antara kelas kontrol dan kelas eksperimen setelah diberikan treatment berupa penggunaan e-learning berbasis schoology menggunakan model discovery learning, nilai sig lebih kecil dari taraf signifikan 0,05 yaitu 0,000 <!--[if gte msEquation 12]><                    <![endif]--&gt;&lt;!--[if !vml]--&gt;&lt;!--[endif]--&gt;&lt;!--[endif]--&gt;&nbsp;0,05. Kedua penggunaan &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<em>e-learning berbasis schoology menggunakan model discovery learning lebih efektif, dengan peningkatan nilai gain sebesar 0,94. Sedangkan pembelajaran konvensional memberikan peningkatan nilai gain sebesar 0,74.   Kata Kunci : Efektivitas, E-learning, Schoology, Model discovery learning, Prestasi belajar siswa",
    "id": 36,
    "title": "Efektivitas Penggunaan E-Learning Berbasis Schoology dengan Menggunakan Model Discovery Learning Terhadap Prestasi Belajar Siswa pada Mata Pelajaran Sistem Komputer Kelas X Multimedia SMK Negeri 6 Surakarta pada Tahun Pelajaran 2015/2016"
  },
  {
    "abstract": "ABSTRAKTujuan Penelitian ini adalah untuk mengembangkan Sistem Informasi Administrasi Program Studi Berbasis Web pada Program Pascasarjana FKIP UNS, sehingga mengelola jadwal kuliah, peminjaman ruang, data fasilitas ruang, mata kuliah dan dosen agar terdigitalisasi serta mudah diakses. Metode penelitian yang di gunakan dalam penelitian ini adalah metode riset dan pengembangan (Research and development). Penelitian ini dilaksanakan di Program Pascasarjana FKIP Universitas Sebelas Maret Surakarta. Pengumpulan data menggunakan metode observasi, metode dokumentasi dan metode literature atau kepustakaan. Pengembangan Sistem Informasi Program Studi dilakukan dengan menempuh beberapa tahap. Tahap pertama dilakukan dengan analisis kebutuhan sistem, merancang flowchart, merancang ERD dan merancang DFD. Tahap kedua adalah tahap pengembangan yaitu pembuatan desain tampilan, pembuatan database dan pembuatan sistem. Tahap ketiga yaitu tahap pengujian oleh beberapa ahli dengan menggunakan instrumen uji coba sistem dilanjutkan dengan revisi sistem. Hasil penelitian ini menunjukan bahwa produk Sistem Informasi Administrasi Program Studi yang dikembangkan memiliki penilaian sebesar 88.4 dari ahli sistem informasi, 86.6 dari ahli substansi administrasi dan 83.5 dari admin prodi (pengguna), sehingga masuk dalam kategori sangat layak digunakan dalam administrasi program studi. Kata Kunci : sistem informasi, administrasi program studi, berbasis web",
    "id": 37,
    "title": "Pengembangan Sistem Informasi Administrasi Program Studi Berbasis Web pada Program Pascasarjana  FKIP UNS   "
  },
  {
    "abstract": "Penelitian ini bertujuan untuk mengetahui apakah (1) penerapan simulatorCisco Packet Tracer dengan model pembelajaran TGT dalam mata pelajaranJaringan Dasar dapat meningkatkan hasil belajar siswa, (2) penerapan simulatorCisco Packet Tracer dengan model pembelajaran TGT dalam mata pelajaranJaringan Dasar dapat meningkatkan keaktifan siswa. Jenis penelitian ini adalah Penelitian Tindakan Kelas. Penelitian ini terdiridari 2 siklus, dengan masing-masing siklus terdiri dari beberapa tahap yakniperencanaan, pelaksanaan tindakan, observasi, dan refleksi yang dimulai daribulan April sampai Mei 2016. Subjek penelitian ini adalah siswa kelas X TKJ 1Sekolah Menengah Kejuruan Negeri 1 Banyudono tahun ajaran 2015/2016 yangberjumlah 33 siswa. Teknik pengumpulan data meliputi observasi, tes, wawancaradan dokumentasi. Validasi data dilakukan dengan cara triangulasi. Analisis datakualitatif dilakukan dengan teknik analisis kritis yang terdiri dari reduksi,penyajian, verifikasi, penarikan kesimpulan, sedangkan data kuantitatif dianalisisdengan teknik statistik deskriptif komparatif. Hasil penelitian menunjukkan bahwa penerapan simulator Cisco PacketTracer dengan model pembelajaran TGT dalam mata pelajaran Jaringan Dasardapat meningkatkan hasil belajar siswa. Peningkatan persentase ketuntasan hasilbelajar siswa ranah kognitif dari pra tindakan 24,24%, siklus I 60,61%, dan siklusII 75,76%. Peningkatan persentase ketuntasan hasil belajar siswa ranah afektifdari pra tindakan 51,52%, siklus I 75,76%, dan siklus II 87,88%. Peningkatanpersentase ketuntasan hasil belajar siswa ranah psikomotorik dari pra tindakan24,24%, siklus I 72,73%, dan siklus II 84,85%. Penerapan simulator Cisco PacketTracer dengan model pembelajaran TGT dalam mata pelajaran Jaringan Dasardapat meningkatkan keaktifan siswa. Peningkatan persentase keaktifan kelas daripra tindakan 33,94%, siklus I 68,48%, dan siklus II 77,58%. Berdasarkan hasilpenelitian, dapat disimpulkan bahwa penerapan simulator Cisco Packet Tracerdengan model pembelajaran TGT dalam mata pelajaran Jaringan Dasar dapatmeningkatkan hasil belajar dan keaktifan siswa kelas X TKJ 1 SMK Negeri 1Banyudono tahun ajaran 2015/2016.  ",
    "id": 38,
    "title": "Penerapan Simulator Cisco Packet Tracer dengan Model Pembelajaran Teams Games Tournament  untuk Meningkatkan Hasil Belajar dan Keaktifan Jaringan Dasar Kelas X TKJ  SMK Negeri 1 Banyudono"
  },
  {
    "abstract": "Penelitian ini bertujuan untuk mengetahui ada tidaknya (1) pengaruhpenggunaan smartphone terhadap hasil belajar kognitif siswa kelas X TKJ SMKNegeri 1 Sukoharjo; (2) pengaruh intensitas bermain game terhadap hasil belajarkognitif siswa kelas X TKJ SMK Negeri 1 Sukoharjo; (3) Adakah interaksipenggunaan smartphone dan intensitas bermain game terhadap hasil belajarkognitif siswa kelas X TKJ SMK Negeri 1 Sukoharjo; dan (4) penggunaansmartphone ataukah intensitas bermain game yang mempunyai sumbangan lebihbesar terhadap hasil belajar kognitif siswa kelas X TKJ SMK Negeri 1 Sukoharjo. Penelitian ini menggunakan metode ex-post facto. Pengumpulan datadilakukan dengan teknik angket untuk data penggunaan smartphone dan intensitasbermain game sedangkan teknik dokumentasi untuk data hasil belajar kognitifsiswa. Analisis data menggunakan uji regresi sederhana dan uji regresi bergandakemudian dilanjutkan dengan uji t-parsial, uji F dan menghitung sumbanganrelatif serta sumbangan efektif. Populasi dalam penelitian ini adalah siswa kelas XTKJ SMK Negeri 1 Sukoharjo. Sampel yang terpilih adalah 61 siswa dari kelas XTKJ A dan X TKJ B dengan teknik pengambilan sampel random sampling. Hasil penelitian adalah sebagai berikut ini. Pertama, ada pengaruhpenggunaan smartphone terhadap hasil belajar kognitif siswa kelas X TKJ SMKNegeri 1 Sukoharjo (t hitung=2,214>t tabel=2,001). Penggunaan smartphoneberpengaruh positif (searah) dan signifikan terhadap hasil belajar kognitif siswa.Penggunaan smartphone yang dimaksudkan adalah penggunaan dengan arahpositif yaitu menggunakan smartphone untuk kegiatan yang bersifat positif.Kedua, ada pengaruh signifikan antara intensitas bermain game terhadap hasilbelajar kognitif siswa kelas X TKJ SMK Negeri 1 Sukoharjo (t hitung=2,841> ttabel=2,001). Intensitas bermain game berpengaruh negatif (tidak searah) dansignifikan terhadap hasil belajar kognitif siswa. Ketiga, ada interaksi signifikanantara penggunaan smartphone dan intensitas bermain game terhadap hasil belajarkognitif siswa kelas X TKJ SMK Negeri 1 Sukoharjo (F hitung=7,790>Ftabel=3,156). Dalam interaksi pengaruh, penggunaan smartphone mempunyaipengaruh positif (searah) terhadap hasil belajar siswa, sedangkan intensitasbermain game mempunyai pengaruh negatif (tidak searah) terhadap hasil belajarsiswa. Keempat, intensitas bermain game memiliki pengaruh yang lebih tinggiterhadap hasil belajar siswa dibandingkan variabel penggunaan smartphone.Penggunaan smartphone memberikan sumbangan efektif 8,42% dengan pengaruhyang positif, sedangkan variabel intensitas bermain game memberikan sumbanganefektif 12,77% dengan pengaruh yang negatif.",
    "id": 39,
    "title": "Pengaruh Penggunaan Smartphone dan Intensitas Bermain Game Terhadap Hasil Belajar Kognitif   Siswa Kelas X SMK Negeri 1 Sukoharjo"
  },
  {
    "abstract": "Tujuan dari penelitian ini adalah: 1) mengidentifikasi keterampilan Computational Thinking yang dapat diperoleh melalui Game-Based Learning sesuai kerangka kerja Brennan & Resnick. 2) mengidentifikasi langkah – langkah mengenalkan Computational Thinking melalui Game-Based Learning.Penelitian ini merupakan penelitian kualitatif dengan desain pendekatan desain skenario dan aktivitas pemrograman. Partisipan dalam penelitian ini merupakan siswa SMK IT Smart Informatika tahun ajaran 2021/2022 sebanyak enam siswa dengan pertimbangan siswa kelas XII yang pernah belajar pemrograman dan atau pernah membuat proyek berbasis pemrograman. Teknik pengumpulan data yang digunakan oleh peneliti pada penelitian ini yakni berupa kuesioner, observasi dan wawancara. Dari ketiga jenis data yang dikumpulkan, agar dapat dipertanggungjawabkan kebenarannya dan dapat dibuktikan keabsahannya, peneliti menerapkan empat kriteria dalam tahap uji validitas data yaitu kredibilitas, transferabilitas, dependabilitas, konfirmabilitas. Observasi dan wawancara digunakan untuk mengetahui apakah ada indikasi perkembangan keterampilan Computational Thinking sesuai dengan kerangka Brennan & Resnick dan kuesioner digunakan untuk mengetahui tingkat kesadaran siswa dalam mempraktikkan keterampilan Computational Thinking tersebut. Data yang terkumpul dianalisis dengan teknik analisis deskriptif kualitatif.Hasil penelitian menunjukkan bahwa penggunaan Game-Based Learning dengan mengadopsi aplikasi Alice 3 dapat digunakan sebagai alat untuk mengindikasi perkembangan keterampilan CT pada siswa SMK sesuai dengan kerangka kerja Brennan & Resnick. Hal ini ditinjau dari hasil analisis deskriptif data observasi dan wawancara yang menunjukan kesesuaian dengan indikator – indikator perkembangan keterampilan CT. Semua keterampilan CT berhasil teridentifikasi melalui observasi. Namun, hanya keterampilan sequences, being incremental and iterative, testing and debugging, reusing and remixing, abstracting and modularizing, expressing, connecting, dan questioning yang bisa teridentifikasi melalui wawancara. Game-Based Learning diterapkan dalam pembelajaran dengan menggunakan pendekatan desain skenario dan aktivitas pemrograman. Pendekatan ini mampu mencakup tiga dimensi keterampilan CT dalam kerangka kerja Brennan & Resnick mulai dari CT Concept, CT Practices, dan CT Perspectives. Hal ini dikonfirmasi pada hasil analisis data observasi dan wawancara yang menunjukan kesesuaian dengan indikator – indikator keterampilan CT menurut kerangka kerja Brennan & Resnick.Kata kunci: alice 3, brennan & resnick, computational thinking, game-based learning",
    "id": 40,
    "title": "Tinjauan Pengaruh Game-Based Learning Terhadap Perkembangan Computational Thinking Skills dari Perspektif Teori Brennan & Resnick"
  },
  {
    "abstract": "Penelitian ini bertujuan untuk mengelompokkan mahasiswa Pendidikan Teknik Informatika dan Komputer, Fakultas Keguruan dan Ilmu Pendidikan, Universitas Sebelas Maret berdasarkan kemiripan gaya belajar tiap mahasiswa dan menganalisis karakteristik pada kelompok yang terbentuk. Dalam penelitian ini menggunakan model gaya belajar Felder dan Silverman (FSLSM) yang mencakup empat dimensi antara lain (1) Active/Reflective; (2) Sensing/Intuitive; (3) Visual/Verbal; dan (4) Sequential/Global;Penelitian ini merupakan penelitian deskriptif kuantitatif. Sampel dalam penelitian ini adalah 58 mahasiswa semester II Program Studi Pendidikan Teknik Informatika dan Komputer, Fakultas Keguruan dan Ilmu Pendidikan, Universitas Sebelas Maret. Pemilihan sampel menggunakan teknik purposive sampling. Pengukuran skor gaya belajar dilakukan dengan menggunakan instrumen Index of Learning Styles yang dikembangkan oleh Felder dan Solomon (1993). Pengelompokan mahasiswa berdasarkan kemiripan gaya belajar Index of Learning Styles dilakukan dengan analisis cluster menggunakan metode hierarchical clustering dan menggunakan teknik average linkage berbantuan software SPSS versi 23.Hasil penelitian ini menunjukkan bahwa terbentuk 2 cluster dominan yang menunjukkan perbedaan dimensi gaya belajar. Cluster 1 memiliki kecenderungan reflective pada dimensi proses belajar dengan rata-rata -3,76, kecenderungan sensing dalam persepsi belajar dengan rata-rata 4,24, kecenderungan visual dalam penginputan informasi dengan rata-rata 5,21, dan kecenderungan global pada dimensi pemahaman informasi dengan rata-rata -2,66. Sedangkan cluster 2 memiliki kecenderungan active pada dimensi proses belajar dengan rata-rata 2,52, kecenderungan sensing dalam persepsi belajar dengan rata-rata 1,48, kecenderungan visual dalam penginputan informasi dengan rata-rata 5,08, dan kecenderungan global pada dimensi pemahaman informasi dengan rata-rata -0,04.",
    "id": 41,
    "title": "Analisis Cluster untuk Pengelompokan Mahasiswa Berdasarkan Index of Learning Styles dengan Metode Hierarchical Clustering"
  },
  {
    "abstract": "Penggunaan teknologi dalam pembelajaran menjadikan kebutuhan akan aplikasi maupun media pembelajaran yang dapat meningkatkan kemampuan berpikir kritis siswa. Dengan adanya model SAMR (Subtitution, Augmentation, Modification dan Redefinition) yang menawarkan metode pengajaran dengan mengintegrasikan teknologi dapat memengaruhi proses pembelajaran dalam meningkatkan kemampuan berpikir kritis siswa. Penelitian kuantitatif ini menggunakan metode eksperimen dengan desain Posttest Only Control Design dengan membagi sampel menjadi 2 kelompok (kelas kontrol dan kelas eksperimen) dengan teknik pengambilan sampel cluster random sampling pada 54 siswa. Hasil posttest kemampuan kognitif kelas kontrol didapatkan nilai rata-rata sebesar 16,52 dan pada kelas eksperimen sebesar 19,63. Selanjutnya hasil posttest kemampuan afektif kelas kontrol didapatkan nilai rata-rata sebesar 74,76 dan pada kelas eksperimen sebesar 84,07. Hal ini menunjukkan adanya perbedaan kemampuan berpikir kritis siswa antara siswa yang menggunakan model SAMR dengan siswa yang tidak menggunakan model SAMR. Pada hasil analisis nilai Gain yang telah dilakukan pada nilai posttest kemampuan kognitif kelas kontrol dan kelas eksperimen diperoleh nilai gain sebesar 0,33 yang termasuk kedalam kriteria Sedang. Sedangkan nilai Gain pada nilai posttest kemampuan kognitif kelas kontrol dan kelas eksperimen diperoleh nilai gain sebesar 0,19 yang termasuk kedalam kriteria Rendah. Penelitian ini membuktikan bahwa penggunaan model SAMR berpengaruh terhadap kemampuan berpikir kritis siswa dan model SAMR terbukti efektif untuk meningkatkan kemampuan berpikir kritis siswa.Kata kunci: kemampuan berpikir kritis, model SAMR, teknologi dalam pendidikan.",
    "id": 42,
    "title": "PENGARUH PENGGUNAAN MODEL SAMR (SUBTITUTION, AUGMENTATION, MODIFICATION AND REDEFINITION) TERHADAP KEMAMPUAN BERPIKIR KRITIS SISWA PADA MATA PELAJARAN PEMROGRAMAN DASAR KELAS X MULTIMEDIA SMK BATIK 2 SURAKARTA"
  },
  {
    "abstract": "Merebaknya virus covid-19 menimbulkan perubahan dalam dunia pendidikan dimana pembelajaran dialihkan menjadi secara daring dengan berbasis teknologi. Pembelajaran daring dimasa pandemi memiliki beberapa kelemahan yaitu leterampilan dalam pemanfaatan teknologi. Ketidakstabilan jaringan internet, keterbatasan perangkat teknologi, pemanfaaatan teknologi yang kurang tepat, dan rentan terhadap kriminalitas. Penerapan laboratorium virtual berbasis private cloud IaaS mejadi referensi yang tepat untuk digunakan sebagai media pembelajaran praktikum mata kuliah jaringan di program studi PTIK UNS pada situasi pandemi Covid-19.Pengembangan laboratorium virtual dibangun dengan langkah yaitu 1) Setup network hardware 2) Instalasi dan klasterisasi Proxmox VE; 3) Membuat Virtual Machine dan Container:4) Manajemen acces user; 5) Setup server VPN dengan OpenVPN. Fungsionalitas Laboratorium virtual diuji dengan mengacu pada instrument Blackbox testing dengan metode requirement testing. Penerimaan teknologi mengacu pada Technology Acceptence Model (TAM) yang menunjukan hasil diterima dalam pembelajaran praktikum mata kuliah administrasi jaringan komputer ditunjukkan dengan rata-rata hasil analisis cluster positif yang tinggi pada aspek kebermanfaatan (79,9%), aspek kemudahan dalam penggunaan (72,2%), aspek E-learning self- Efficacy (71,7%), aspek niat perilaku untuk menggunakan (57%), dan aspek penggunaan sesungguhnya (40,6%). Aspek kerumitan memiliki hasil cluster netral dan negatif tinggi yaitu 38,3?n 35,8%. Tetapi hasil tersebut menunjukan dari tingkat kerumitan yang rendah. Yang perlu menjadi perhatian adalah pada aspek keterbatasan waktu dimana rata-rata nilai cluster postifnya tinggi (40,8%).Kata kunci: Laboratorium Virtual, Cloud Computing, Covid-19. ",
    "id": 43,
    "title": "Rancang Bangun Laboratorium Virtual Berbasis Private Cloud Dengan Model Layanan IAAS Sebagai Media Praktikum Jaringan Komputer"
  },
  {
    "abstract": "Kemandirian belajar adalah kesiapan individu untuk belajar dengan inisiatif sendiri, dengan atau tanpa bantuan pihak lain dalam hal penentuan tujuan, metode dan evaluasi hasil belajar. Salah satu model  pembelajaran yang  dapat  digunakan  dalam  upaya meningkatkan kemandirian belajar siswa adalah flipped classroom.Penelitian ini bertujuan mengetahui (1) Apakah terdapat perbedaan kemandirian pada penerapan model pembelajaran Blended Learning dengan strategi Flipped Classroom dengan model pembelajaran konvensional; (2) Apakah terdapat perbedaan hasil belajar siswa pada penerapan model pembelajaran Blended Learning dengan strategi Flipped Classroom dengan model pembelajaran konvensional (3) Apakah terdapat peningkatan kemandirian pada penerapan model pembelajaran Blended Learning dengan strategi Flipped Classroom dengan model pembelajaran konvensional; (4) Apakah terdapat peningkatan hasil belajar siswa pada penerapan model pembelajaran Blended Learning dengan strategi Flipped Classroom dengan model pembelajaran konvensional.Model desain pretest-posttest control group design diterapkan dalam penelitian ini, yang menggunakan metode quasi eksperimental design. Partisipan dalam penelitian ini adalah siswa kelas X Multimedia 1 dan X Multimedia 2 SMK Negeri 1 Gondang. Jumlah siswa yang digunakan dalam penelitian ini sebanyak 70 orang. Total sampling digunakan sebagai metode sampling. Pretests, posttests, dan kuesioner digunakan untuk mengumpulkan data. Uji keseimbangan, uji normalitas, uji homogenitas, dan uji hipotesis termasuk di antara prosedur analisis data yang digunakan. Hasil penelitian mengungkapkan bahwa model pembelajaran Blended Learning dengan strategi flipped classroom berdampak pada kemandirian dan hasil belajar siswa. ",
    "id": 44,
    "title": "Pengaruh Model Pembelajaran Blended Learning Dengan Strategi Flipped ClassroomTerhadap Kemandirian Dan Hasil Belajar Pada Mata Pelajaran Simulasi Digital Siswa Kelas X Di SMK Negeri 1 Gondang"
  },
  {
    "abstract": "Teknologi IoT berkembang pesat dengan cepat. Teknologi IoT seluruhnya diterapkan pada seluruh bidang kehidupan manusia termasuk bidang pendidikan. Dalam dunia pendidikan, IoT merupakan sebuah sistem yang memungkinkan untuk meningkatkan kemudahan dalam proses belajar mengajar, contohnya penerapan teknologi IoT adalah pada smart clasrooms.Literatur terbaru menyatakan bahwa Konsep Internet of Things (IoT) mampu memainkan peran penting dalam meningkatkan aspek cerdas yang sudah diterapkan di bidang pendidikan. Makalah ini bertujuan untuk mensurvei implementasi terbaru dari sistem pemantauan berbasis IoT yang diterapkan di bidang pendidikan. Makalah ini  merekomendasikan  strategi  untuk  mengadopsi  alat  pemantauan  berbasis  IoTterkait dengan penerapan sistem irigasi di Indonesia. Kata kunci: agriculture monitoring systems, drip irrigation system, internet ",
    "id": 45,
    "title": "Evaluasi Sistem Monitoring pada Perangkat Drip Irrigation System untuk Pembelajaran Internet of Things"
  },
  {
    "abstract": "Herman Sanjaya. K3515028. THE EFFORTS TO IMPROVE STUDENTS’ LEARNING RESULTS AND PARTICIPATION THROUGH EDMODO-ASSISTED BLENDED LEARNING MODEL IN THE NETWORK SERVICE TECHNOLOGY COURSE OF CLASS XI TKJ 2 IN SMK NEGERI 1 BANYUDONO. Undergraduate Thesis, Surakarta: Faculty of Teacher Training and Education, Universitas Sebelas Maret Surakarta, September 2019. The research aims to improve the learning results and participation of the students of class XI TKJ 2 SMK Negeri 1 Banyudono in the Network Service Technology through the application of Edmodo-assisted Blended Learning Model.This is a classroom action research (CAR). This research was conducted in two cycles consisting of four stages, namely: the planning stage, the implementation stage, the observation stage, and the reflection stage. The subjects of this research were 34 students of class XI TKJ 2 SMK Negeri 1 Banyudono. The data were collected by tests, observations, interviews, and documentation techniques. The data were then validated using triangulation technique. Then, the data were analyzed using quantitative descriptive analysis model.The results showed that the application of Edmodo-assisted blended learning model could improve the learning result of Network Service and Technology course of the students of class XI TKJ 2 SMK Negeri 1 Banyudono. The improvement was proven by the increasing cognitive and participation score of the students in every cycle. In the pre-action, the average score of students’ cognitive learning result was 66.618 with a completeness percentage of 47.05%, and the students’ participation percentage was 61.02%. In cycle I, the average score of students’ cognitive learning result was 89.853 with a completeness percentage of 94.11%, and the students’ participation percentage was 73.94%. Those numbers have reached the achievement target, but there were still several indikators which have not reached the target. In cycle I, the average score of students’ cognitive learning result was 91.912 with a completeness percentage of 94.11%, and the students’ participation percentage was 84.76%, in which it has reached the target indikator, where each indikator has reached a limit of 70%. This research concluded that the application of Edmodo-assisted blended learning model could improve the cognitive learning and participation of Network Service and Technology course of students of class XI TKJ 2 SMK Negeri 1 Banyudono.",
    "id": 46,
    "title": "Upaya Meningkatkan Hasil Belajar dan Keaktifan Siswa Melalui Model Pembelajaran Blended Learning dengan Berbantukan Edmodo Mada Mata Pelajaran Teknologi Layanan Jaringan Kelas XI TKJ 2 di SMK Negeri 1 Banyudono"
  },
  {
    "abstract": "Pembelajaran daring di Sekolah Menengah Kejuruan (SMK) di Indonesia menimbulkan banyak permasalahan baru dalam pelaksanaanya seperti rendahnya tingkat motivasi dan minat belajar siswa dalam pembelajaran, kurangnya tingkat kehadiran siswa dalam pembelajaran, tingkat pemahaman siswa masih kurang kondisi siswa tersebut menyebabkan capaian kompetensi dalam pembelajaran kurang memuaskan. Untuk mengatasi permasalahan tersebut guru dapat mengupayakan beberapa cara yang dapat digunakan seperti salah satunya menggunakan variasi metode dan pendekatan pembelajaran seperti metode STEAM dengan pendekatan konstruktivisme. Setiap elemen dalam STEAM bertujuan untuk meningkatkan kreativitas, inovasi, dan minat, mempromosikan keterampilan pemecahan masalah dan minat kognitif lainnya. Pendekatan konstruktivisme membuat siswa lebih dominan dalam pembelajaran mereka sendiri. Temuan dalam penelitian ini adalah sebuah prosedur pembelajaran daring menggunakan metode STEAM dan pendekatan konstruktivisme yang diekslporasi untuk dapat meningkatkan aspek kemampuan siswa dalam pembelajaran. Metode penelitian yang digunakan dalam penelitian ini adalah wawancara dan observasi yang terbagi kedalam tiga tahapan. Data awal didapatkan menggunakan wawancara dengan guru dan partisipan, kemudian pada proses penelitian data dikumpulkan melalui pengamatan observasi selama kegiatan pembelajaran, dan yang terakhir evaluasi yang dilakukan dengan wawancara refleksi terkait pembelajaran. STEAM diintegrasikan kedalam rencana pelaksanaan pembelajaran desain grafis menggunakan tahapan integrasi STEAM pembelajaran berbasis proyek yang kemudian digabungkan dan diimplementasikan dengan tahapan pendekatan pembelajaran konstruktivisme. Data yang terkumpul kemudian dilakukan reduksi data, disajikan dan dianalisis untuk kemudian dapat ditarik kesimpulan dan hasil. Hasil penelitian yang didapatkan antara lain (1) prosedur pelaksanaan pembelajaran desain grafis terintegrasi STEAM berbantuan pendekatan konstruktivisme yang terdiri dari enam tahapan pembelajaran yang meliputi situation yang meliputi menciptakan situasi yang menggambarkan materi pembelajaran sesuai dengan topik pembahasan, question meliputi pemberian pertanyaan essensial kepada siswa, bridge meliputi diskusi identifikasi masalah, perencanaan perancangan proyek dan penyusunan jadwal, grouping & monitoring meliputi pemberian masalah sederhana serta pengelompokan partisipan dalam kelompok kecil yang kemudian diawasi setiap kegiatanya, presentation meliputi penyajian hasil dan penilaian hasil proyek, dan evaluation yang meliputi evaluasi pengalaman partisipan melalui refleksi wawancara. (2) pembelajaran terintegrasi STEAM berbantuan pendekatan konstruktivisme menghasilkan adanya beberapa peningkatan aspek prestasi siswa seperti aspek sikap dan keterampilan dalam pembelajaran.Kesimpulan dari penelitian ini menunjukan bahwa pembelajaran menggunakan metode STEAM dengan pendekatan konstruktivisme dalam pembelajaran berbasis proyek yang dilaksanakan secara daring berhasil meningkatkan kemampuan siswa dalam dua aspek yaitu aspek sikap dan aspek keterampilan selain itu adanya penggunaan metode STEAM dan pendekatan konstruktivisme mampu menciptakan lingkungan belajar yang menyenangkan dan dapat dengan mudah diterima oleh para siswa. ",
    "id": 47,
    "title": "Integrasi STEAM (Science, Technology, Engineering, Art, Mathematics) dengan Kompetensi Dasar Mata Pelajaran Desain Grafis Menggunakan Pendekatan Konstruktivisme pada Siswa SMK"
  },
  {
    "abstract": "Permasalahan yang terjadi dalam mempelajari bahasa isyarat Indonesia, khususnya untuk di daerah Solo yaitu jarangnya pembukaan kelas bahasa isyarat untuk umum dan penggunaan media pembelajaran yang terbatas seperti penggunaan powerpoint dan gambar materi bahasa isyarat pada kertas. Tujuan dari penelitian ini adalah mengembangkan sebuah aplikasi media pembelajaran bahasa isyarat berbasis Android dan menguji tingkat kelayakan aplikasi media pembelajaran bahasa isyarat yang telah dikembangkan Penelitian ini menggunakan dengan metode penelitian dan pengembangan dengan model pengembangan ADDIE. Proses pada model ADDIE, yaitu analisis (analysis), perancangan (design), pengembangan (develop), implementasi (implementation) dan evaluasi (evaluation). Penelitian ini berpusat pada uji kelayakan dari aplikasi media pembelajaran dengan menggunakan indikator-indikator pada Standar ISO 25010 yang digunakan untuk menguji kelayakan software. Aspek yang diuji yaitu aspek functional suitability, aspek usability, aspek portability dan validasi oleh ahli materi dan ahli media. Hasil dari penelitian ini adalah sebuah aplikasi media pembelajaran bahasa isyarat berbasis Android. Hasil dari uji kelayakan yang didapatkan, untuk uji functional suitability 100%, uji usability 83.2%, uji portability 100%, uji ahli materi mendapatkan nilai 100?n uji ahli media mendapatkan nilai 93?n dapat disimpulkan aplikasi media pembelajaran bahasa isyarat “sangat layak” digunakan. Kata Kunci : Bahasa Isyarat, ADDIE, Bisindo ",
    "id": 48,
    "title": "Pengembangan Aplikasi Media Pembelajaran untuk Pembelajaran Bahasa Isyarat Berbasis Android"
  },
  {
    "abstract": "Penelitian ini bertujuan untuk menguji ada tidaknya (1) Perbedaan hasil belajar antara penerapan model pembelajaran kooperatif tipe TGT berbantuan aplikasi Quizizz dan model pembelajaran konvensional; (2) Perbedaan hasil belajar antara siswa yang memiliki motivasi belajar kategori tinggi dan rendah; (3) Interaksi antara penerapan model pembelajaran kooperatif tipe TGT berbantuan aplikasi Quizizz dan motivasi belajar terhadap hasil belajar.     Model yang digunakan dalam penelitian ini adalah metode eksperimen dengan desain faktorial 2X2 (AXB). Populasi penelitian adalah seluruh siswa kelas X SMK Negeri 6 Surakarta. Pengambilan sampel diambil secara acak (cluster random sampling) sehingga didapatkan 2 kelas, kelas X MM 1 terdiri dari 32 siswa dengan perlakuan pembelajaran konvensional sebagai kelompok kontrol dan kelas X MM 2 terdiri dari 32 siswa dengan perlakuan pembelajaran kooperatif tipe TGT berbantuan aplikasi Quizizz sebagai kelompok eksperimen. Teknik pengumpulan data penelitian ini menggunakan kuesioner dan tes. Analisis data yang digunakan adalah analisis variansi dua jalan dengan isi sel tidak sama.     Berdasarkan penelitian ini, dapat disimpulkan sebagai berikut: (1) Terdapat perbedaan hasil belajar antara penerapan model pembelajaran kooperatif tipe TGT berbantuan aplikasi Quizizz dan model pembelajaran konvensional berdasarkan hasil belajar siswa (Sig. = 0,000 <0 xss=removed xss=removed>Kata Kunci: Kooperatif, TGT, Motivasi Belajar, Hasil Belajar.",
    "id": 49,
    "title": "Pengaruh penerapan model pembelajaran cooperative learning tipe teams games tournament (TGT) berbantuan aplikasi quizizz terhadap hasil belajar ditinjau dari motivasi belajar pada mata pelajaran simulasi digital"
  },
  {
    "abstract": "Penelitian ini bertujuan untuk mengembangkan sebuah sistem informasi manajemen kegiatan pembelajaran berbasis web yang dapat digunakan untuk manajemen data kurikulum dan pembelajaran serta menguji kelayakan dari sistem informasi yang dikembangkan.Penelitian ini dilaksanakan di Sekolah Haji dan Umrah Baitullah Rubaiyat. Metode yang digunakan adalah metode Penelitian dan Pengembangan dimana peneliti menggunakan metode pengembangan waterfall untuk mengembangkan sistem dan Uji Kelayakan menggunakan Stadart ISO 25010 yang memiliki 8 aspek. Namun pada penelitian ini peneliti hanya menggunakan 4 aspek yaitu functional suitability, performance, portability dan usability. Pengujian dilakukan menggunakan 2 metode yaitu Black Box dan menggunakan instrument dari USE Questionnaire. Metode Black Box digunakan untuk menguji 3 aspek dari ISO yaitu functional suitability, performance, dan portability, pengujian Black Box dilakukan dengan cara manual untuk menguji  functional dan portability dan menggunakan bantuan alat GT Matrix untuk menguji performance  dari sistem yang digunakan. Untuk uji kelayakan dari user atau aspek usability menggunakan menggunakan angket Use Questionnaire oleh Arnold M.Lund (2001). Pengujian angket dilakukan setelah sistem berhasil dipasang dan diterapkan. Pada pengujian ini menggunakan 10 responden yang terdiri dari setiap aktor yang dapat mengoprasikan sistem yaitu administrator, pengajar dan peserta didik.Berdasarkan hasil pengujian yang dilakukan dapat diambil kesimpulan bahwa sistem informasi manajemen kegiatan pembelajaran dapat mempermudah berjalannya kegiatan manajemen pembelajaran pada sekolah Haji dan Umrah Baitullah Rubaityat baik dari pelaksanaan administrasi sampai dengan proses pembelajaran. Hasil pengujian kelayakan sistem menunjukan bahwa pengembangan Sistem Informasi Manajemen Kegiatan Pembelajaran Berbasis Web yang dikembangkan memiliki nilai 80,49?ngan Use Quetionnaire dan lolos pada Uji Blackbox. Sehingga dapat disimpulkan bahwa Sistem Informasi Manajemen Kegiatan Pembelajaran ini sangat layak untuk digunakan.Kata Kunci : sistem informasi, manajemen pembelajaran, berbasis web , USE Quetionnaire, Black Box testing",
    "id": 50,
    "title": " Pengembangan sistem informasi manajemen kegiatan pembelajaran berbasis web untuk sekolah haji dan umroh  Baitullah Rubaiyat"
  },
  {
    "abstract": "Penelitian ini dilakukan bertujuan untuk memperoleh gambaran kesiapan siswa smp dalam menerima pembelajaran pemrograman. Dalam penelitian ini dilakukan analisa dengan melihat kemampuan computational thinking (CT) yang ditampilkan siswa selama kegiatan. Metode pendekatan yang digunakan adalah kualitatif deskriptif yang dilakukan pada siswa Madrasah Tsanawiyah Negeri Surakarta 1 kelas 7 Fullday 3. Hasil yang diperoleh menunjuk bahwa siswa setidaknya mampu menampilkan sedikit kemampuan CT. Perbedaan kemampuan CT yang ditampilkan oleh masing-masing siswa dapat menjadi dasar pertimbangan dalam menyususn pembelajaran pemrograman yang sesuai. Dengan mengetahui tingkat kemampuan CT, dapat dperoleh kesiapan pembelajaran pemrograman siswa. Pembelajaran pemrograman dapat disesuaikan pada kesiapan siswa, sehingga kemampuan-kemampuan yang dirasa kurang dapat ditingkatkan terlebih dahulu sebelum memulai pembelajaran pemrograman.Kata Kunci: Pendidikan tingkat menengah; kemampuan abad ke-21; strategi pembelajaran/pengajaran",
    "id": 51,
    "title": "Analisis kesiapan pembelajaran pemrograman pada siswa Madrasah Tsanawiyah Negeri Surakarta 1 berdasarkan kemampuan berpikir komputasi"
  },
  {
    "abstract": "ABSTRAKPenelitian ini bertujuan untuk meningkatkan pemahaman membaca algoritma siswa pada mata pelajaran pemrograman dasar, terutama pada kompetensi dasar struktur kontrol cabang dengan menggunakan model pembelajaran SQ6R (Survey, Question, Read, Reflect, Review, Rehash, Rethink, Reevaluate). Penelitian dimulai dengan mengidentifikasi masalah yang terjadi di kelas. Kemudian merancang suatu tindakan untuk mengatasinya dalam suatu siklus tindakan. Dalam penelitian ini administrasi tindakan berlangsung dalam 2 siklus. Setiap siklus terdiri dari tahapan perencanaan, pelaksanaan, pengamatan, dan refleksi. Teknik pengumpulan data dilakukan melalui tes pemahaman membaca siswa. Analisis data dilakukan dengan menggunakan analisis kuantitatif dan kualitatif. Hasil penelitian menunjukkan bahwa model pembelajaran SQ6R dapat meningkatkan pemahaman membaca algoritma siswa. Hal ini ditunjukkan oleh persentase ketuntasan hasil tes pemahaman membaca siswa sebesar 38,9% pada pra siklus, 47,2% pada siklus 1 dan 83,3% pada siklus 2.Kata Kunci : Model Pembelajaran, SQ6R, Pemahaman Algoritma ",
    "id": 52,
    "title": "Penerapan Model Pembelajaran Sq6r  Untuk Meningkatkan Pemahaman Algoritma Pada Mata Pelajaran Pemrograman Dasar Di Kelas X Tkj 1 Smk Negeri 1 Sawit Boyolali"
  },
  {
    "abstract": "Penelitian ini bertujuan untuk mengetahui kesesuaian komponen game edukatif yang beredar di Google Play Store ditinjau dari  (1) sudut pandang elemen-elemen yang terkandung dalam gamifikasi?; (2) konten game dengan kurikulum yang berlaku dalam pembelajaran berhitung untuk tingkat awal sekolah dasar tingkat rendah (kelas 1-3 SD).Data penelitian ini berwujud kumpulan game edukatif yang terkait dengan tema penelitian, yaitu mengenai pembelajaran berhitung yang dikumpulkan melalui observasi dengan pencarian di Google Play Store, yaitu pasar aplikasi berbasis android, yang kemudian hasilnya di seleksi berdasarkan kata kunci yang terkait dan memiliki relevansi dengan unsur gamifikasi dan kesesuaian kurikulum di Indonesia dengan konten game-nya.Hasil penelitian adalah sebagai berikut ini. Pertama, kesesuaian komponen game berhitung untuk SD kelas rendah (1-3) masih cukup rendah dari sisi gamifikasi. Rata-rata skor keseluruhan adalah 0.49. Aspek paling banyak terpenuhi adalah aspek Rintangan (terdapat dalam elemen Dinamika) dan Progress (terdapat dalam elemen Dinamika), keduanya memiliki skor rata-rata pemenuhan sebesar 0.99, dan aspek yang paling banyak tidak terpenuhi adalah aspek Kerjasama (terdapat dalam elemen Mekanika) dan Tim (terdapat dalam elemen Komponen) yang memiliki skor rata-rata pemenuhan sebesar 0. Kedua, Kesesuaian komponen game berhitung untuk SD kelas rendah (1-3) juga cukup rendah dari sisi kurikulum. Rata-rata skor keseluruhan adalah 0.40. Aspek yang paling banyak terpenuhi adalah aspek Bilangan yang memiliki skor rata-rata pemenuhan sebesar 0.98, dan aspek yang paling banyak tidak terpenuhi adalah aspek Statistika yang memiliki skor rata-rata pemenuhan sebesar 0.05. ",
    "id": 53,
    "title": "Studi Evaluasi Terhadap Game Edukatif untuk Pendidikan SD (Kelas Rendah) Dalam Pembelajaran Berhitung Ditinjau dari Aspek Gamifikasi dan Kurikulum"
  },
  {
    "abstract": "Penelitian ini bertujuan untuk mengetahui (1) manakah yang menghasilkan prestasi belajar yang lebih baik antara model pembelajaran kooperatif tipe think talk write (TTW) atau model pembelajaran konvensional; (2) manakah yang menghasilkan prestasi belajar yang lebih baik, siswa dengan gaya belajar visual, siswa dengan gaya belajar auditorial atau siswa dengan gaya belajar kinestik; (3) pada masing-masing penerapan model pembelajaran kooperatif tipe think talk write (TTW) atau model pembelajaran konvensional yang menghasilkan prestasi belajar lebih baik siswa dengan gaya belajar visual, auditorial atau kinestik; (4) pada masing-masing kategori gaya belajar yang menghasilkan prestasi belajar lebih baik penggunaan model pembelajaran kooperatif tipe think talk write (TTW) atau model pembelajaran konvensional. Sampel yang terpilih adalah 72 peserta didik kelas X tahun ajaran 2017/2018.Penelitian ini menggunakan jenis penelitian kuantitatif deskriptif. Pengumpulan data dilakukan dengan penyebaran angket dan dokumentasi. Analisis data menggunakan Analisis variansi dua arah dengan sel tak sama. Hasil penelitian yang diperoleh menjelaskan bahwa (1) pembelajaran dengan pendekatan TTW menghasilkan prestasi yang lebih baik jika dibanding dengan pendekatan konvensional pada materi bahasan perakitan komputer (2) Gaya belajar siswa visual, auditorial maupun kinestetik tidak memberikan perbedaan prestasi belajar perakitan komputer (3) Tidak ada interaksi yang signifikan antara pendekatan pembelajaran dan gaya belajar siswa terhadap prestasi belajar perakitan komputer. Siswa, yang mengikuti pembelajaran dengan pendekatan TTW mempunyai prestasibelajar lebih baik dari pada siswa yang mengikuti pembelajaran dengan pendekatan konvensional baik pada siswa yang memiliki gaya belajar visual, auditorial maupun kinestetik.",
    "id": 54,
    "title": "Perbedaan Prestasi Belajar Ditinjau dari Gaya Belajar pada Penerapan Model Pembelajaran Kooperatif Tipe Think Talk Write (TTW) di SMK Negeri 1 Sawit"
  },
  {
    "abstract": "Penelitian ini bertujuan untuk mengetahui ada tidaknya (1) perbedaan prestasi belajar antara siswa yang mendapat model pembelajaran konvensional dengan model pembelajaran u-learning; (2) perbedaan prestasi belajar antara siswa yang memiliki motivasi belajar tinggi, sedang dan rendah; dan (3) pengaruh interaksi antara model pembelajaran dengan motivasi belajar terhadap prestasi belajar. Penelitian ini menggunakan metode penelitian eksperimen.Penelitian ini merupakan jenis penelitian eksperimen. Populasi dalam penelitian ini yaitu seluruh siswa kelas X TKJ SMK Yapek Gombong. Sampel yang digunakan yaitu kelas X TKJ 1 yang berjumlah 32 siswa dan kelas X TKJ 2 yang berjumlah 25 siswa. Teknik sampling yang digunakan yaitu teknik simple random sampling.  Teknik  pengumpulan  data menggunakan  metode kuesioner,  tes  dan dokumentasi. Teknik analisis data yang digunakan yaitu uji keseimbangan, uji normalitas dan uji homogenitas dengan taraf signifikansi 5% serta uji hipotesis menggunakan uji –t dan uji anava dua jalan dengan sel tak sama.Hasil penelitian adalah sebagai berikut. Pertama, terdapat perbedaan prestasi belajar antara siswa yang mendapat model pembelajaran konvensional dengan model u-learning. Pembelajaran dengan model u-learning memberikan prestasi belajar yang lebih baik dibandingkan pembelajaran dengan model konvensional, karena dengan pembelajaran u-learning memudahkan bagi siswa untuk memahami kembali materi pelajaran dan menjadikan siswa lebih aktif pada saat pembelajaran berlangsung yang berdampak pada prestasi belajar siswa. Kedua, terdapat perbedaan prestasi belajar antara siswa yang memiliki motivasi belajar tinggi, sedang dan rendah. Siswa dengan motivasi belajar tinggi memiliki prestasi belajar yang lebih baik dibandingkan dengan siswa yang motivasi belajarnya sedang dan rendah. Sedangkan siswa dengan prestasi belajar sedang juga memiliki prestasi belajar yang lebih baik dibandingkan siswa dengan prestasi belajar rendah. Ketiga, terdapat pengaruh interaksi antara model pembelajaran dengan motivasi belajar terhadap prestasi belajar.",
    "id": 55,
    "title": "Studi Komparasi Antara Model Pembelajaran Konvensional dengan Model Ubiquitous Learning (U-Learning) Terhadap Prestasi Belajar Ditinjau dari Motivasi Belajar Siswa pada Mata Pelajaran Simulasi dan Komunikasi Digital Kelas X SMK Yapek Gombong"
  },
  {
    "abstract": "Penelitian ini bertujuan untuk mengetahui (1) pengaruh persepsi siswamengenai kompetensi pedagogik guru terhadap prestasi belajar siswa pada matapelajaran sistem komputer; (2) pengaruh persepsi siswa mengenai kompetensikepribadian guru terhadap prestasi belajar siswa pada mata pelajaran sistemkomputer; (3) pengaruh persepsi siswa mengenai kompetensi sosial guru terhadapprestasi belajar siswa pada mata pelajaran sistem komputer; (4) pengaruh persepsisiswa mengenai kompetensi profesional guru terhadap prestasi belajar siswa padamata pelajaran sistem komputer; (5) pengaruh persepsi siswa mengenaikompetensi pedagogik guru, kompetensi kepribadian guru, kompetensi sosialguru, dan kompetensi profesional guru secara bersama – sama terhadap prestasibelajar siswa pada mata pelajaran sistem komputer.Populasi dalam penelitian ini adalah siswa kelas X dan XI jurusan TKJ diSMK Negeri 1 Banyudono. Penelitian ini merupakan penelitian kuantitatif denganmetode survei. Pengumpulan data menggunakan metode angket dan dokumentasi.Analisis data menggunakan regresi ganda.Hasil penelitian ini adalah sebagai berikut ini. Pertama, tidak terdapatpengaruh yang positif dan signifikan persepsi siswa mengenai kompetensipedagogik guru terhadap prestasi belajar siswa pada mata pelajaran sistemkomputer di SMK Negeri 1 Banyudono. Kedua, tidak terdapat pengaruh yangpositif dan signifikan persepsi siswa mengenai kompetensi kepribadian guruterhadap prestasi belajar siswa pada mata pelajaran sistem komputer di SMKNegeri 1 Banyudono. Ketiga, tidak terdapat pengaruh yang positif dan signifikanpersepsi siswa mengenai kompetensi sosial guru terhadap prestasi belajar siswapada mata pelajaran sistem komputer di SMK Negeri 1 Banyudono. Keempat,terdapat pengaruh yang positif dan signifikan persepsi siswa mengenaikompetensi profesional guru terhadap prestasi belajar siswa pada mata pelajaransistem komputer di SMK Negeri 1 Banyudono. Kelima, terdapat pengaruh yangpositif dan signifikan persepsi siswa mengenai kompetensi pedagogik guru,kompetensi kepribadian guru, kompetensi sosial guru, dan kompetensi profesionalguru secara bersama – sama terhadap prestasi belajar siswa pada mata pelajaransistem komputer di SMK Negeri 1 Banyudono.Kata Kunci: persepsi siswa, kompetensi guru, prestasi belajar siswa ",
    "id": 56,
    "title": "Pengaruh persepsi siswa mengenai kompetensi guru terhadap prestasi belajar siswa pada mata pelajaran sistem komputer di smk negeri 1 Banyudono"
  },
  {
    "abstract": "Penelitian ini bertujuan untuk mengembangkan aplikasi English for Disability (EFORD) yaitu media pembelajaran bahasa Inggris berbasis Android untuk siswa kelas VII Tunanetra SMPLB YKAB Surakarta dan mengetahui tingkat kelayakan aplikasi English for Disability (EFORD) berdasarkan penilaian ahli materi, ahli media, praktisi pembelajaran dan siswa.Metode penelitian yang digunakan dalam penelitian ini adalah Penelitian dan Pengembangan (Research and Development), langkah-langkah pengembangan aplikasi English for Disability (EFORD) dilakukan dalam beberapa tahap meliputi mencari potensi dan masalah, pengumpulan data, desain produk, validasi desain dan uji coba produk. Perancangan aplikasi English for Disability (EFORD) berbasis Android untuk anak tunanetra melalui 5 tahap yaitu: (1) Analisis permasalahan, melalui observasi dan wawancara. (2) Mengumpulkan informasi sebagai bahan perencanaan produk/analisis kebutuhan media sesuai kebutuhan anak tunanetra. (3) Tahap desain produk berupa pembuatan alur peta navigasi dan storyboard. (4) Tahap validasi desain berupa penilaian dari ahli terhadap media yang dikembangkan. (5) Tahap uji coba produk berupa penilaian aplikasi oleh siswa tunanetra.Penelitian ini menghasilkan aplikasi EFORD yang layak digunakan sebagai media pembelajaran bahasa Inggris dengan tingkat kelayakan media EFORD ini berdasarkan penilaian: 1) Ahli media diperoleh persentase skor 95% termasuk dalam kategori “ Sangat Layak”, 2)Ahli materi, diperoleh persentase skor 75%, termasuk dalam kategori “Layak” dan 3) Praktisi pembelajaran, diperoleh persentase skor 83%, termasuk kategori “Sangat Layak”. Respon siswa terhadap media ini menunjukan respon positif dengan mendapatkan persentase ≥ 70% pada setiap indikatornya. Oleh karena itu, media pembelajaran bahasa Inggris dengan aplikasi EFORD berbasis Android ini sangat layak digunakan sebagai media pembelajaran bahasa Inggris pada materi grammar dan speaking english untuk siswa tunanetra kelas VII SMPLB YKAB Surakarta.Kata Kunci : media pembelajaran, aplikasi mobile, Android",
    "id": 57,
    "title": "Pengembangan Media Pembelajaran Berbasis Android, “English for Disability” pada Materi Grammar & Speaking English Untuk Siswa Kelas VII Tunanetra SMPLB YKAB Surakarta"
  },
  {
    "abstract": "Penelitian ini bertujuan untuk : 1) Menghasilkan rancangan produk job sheet interaktif perawatan PC untuk kelas X TKJ di SMK, dan 2) Mengetahui tingkat kelayakan dari job sheet interaktif perawatan PC. Metode penelitian yang digunakan adalah Research and Development yang mengacu pada prosedur pengembangan Borg and Gall. Penelitian ini meliputi 5 tahap yaitu analisis potensi dan masalah, pengumpulan data, desain produk, validasi desain dan perbaikan desain. Validasi desain dilaksanakan oleh ahli media, ahli materi dan pengguna. Validasi desain pengguna dilaksanakan dua kali yaitu, pertama penilaian pengguna (terbatas) yang terdiri dari satu guru produktif dan 3 siswa kelas X TKJ dan penilaian pengguna (diperluas) dilaksanakan oleh 32 siswa kelas X TKJ 1. Penilaian pengguna (diperluas) dilaksanakan setelah melaksanakan perbaikan sesuai dari hasil penilaian ahli media, ahli materi dan penilaian pengguna (terbatas).Penelitian ini menggunakan teknik pengumpulan data wawancara, angket dan dokumentasi. Sedangkan teknik analisis data dilaksanakan dengan cara deskriptif kualitatif dari data kuantitatif untuk pengembangan job sheet interaktif perawatan PC. Hasil penelitian dan pengembangan ini menunjukan bahwa: 1) Dihasilkan rancangan produk job sheet interaktif yang dikembangkan menggunakan software Adobe Flash CS6 Profesional. 2) Hasil rerata penilaian tingkat kelayakan job sheet interaktif oleh ahli materi adalah 88% masuk pada kategori sangat layak, rerata penilaian dari ahli media sebesar 83% masuk pada kategori sangat layak, penilaian pengguna (terbatas) dengan rerata penilaian sebesar 97% masuk pada kategori sangat layak dan penilaian pengguna (diperluas) dengan rerata penilaian sebesar 83% masuk pada kategori sangat layak. Kata kunci : pengembangan, media pembelajaran interaktif, job sheet, SMK, adobe flash.",
    "id": 58,
    "title": "Pengembangan job sheet interaktif menggunakan aplikasi berbasis   komputer pada materi perawatan pc di kelas x tkj  smk negeri 1 Sawit "
  },
  {
    "abstract": "Tujuan penelitian ini adalah untuk mengetahui apakah penerapan project based learning dapat meningkatkan aktivitas dan kompetensi belajar siswa dalam Instalasi Sistem Operasi Berbasis GUI ( Graphical User Interface) dan CLI ( Command Line Interface) kelas X TKJ SMK N 1 Sawit.Penelitian ini menggunakan metode Penelitian Tindakan Kelas (PTK) yang dilaksanakan sebanyak dua siklus dimana masing – masing siklus dilakukan dengan empat tahapan, yaitu : (1) tindakan perencanaan; (2) tindakan pelaksanaan; (3) tindakan observasi; dan (4) refleksi. Subjek penelitian adalah siswa kelas X TKJ 3 di SMK N 1 Sawit sebanyak 34 siswa. Penelitian ini dilaksanakan dengan kolaborasi antara peneliti, guru, observer dan melibatkan partisipasi siswa. Teknik pengumpulan data menggunakan lembar observasi, wawancara, instrumen tes dan teknik analisis data.Berdasarkan hasil penelitian, dapat disimpulkan bahwa penerapan project based learning dapat meningkatkan aktivitas dan kompetensi instalasi sistem operasi berbasis GUI dan CLI. Hal ini terbukti dari fakta – fakta hasil sebagai berikut : (1) Aktivitas siswa dalam mengikuti pembelajaran mengalami peningkatan pada pra siklus sebesar 32,35% menjadi 58,82% pada siklus I dan pada siklus II meningkat menjadi 82,35%. (2) Kompetensi siswa dalam pembelajaran terdisi dari 3 ranah yaitu masing – masing ranah meengalami peningkatan sebagai berikut : (a) Ranah Kognitif dari pra siklus sebesar 11,76% menjadi 26,47% pada siklus I dan siklus II meningkat menjadi sebesar 47,05%. (b) Ranah Afektif dari pra siklus sebesar 32,35% menjadi 53,29% pada siklus I dan pada siklus II meningkat menjadi sebesar 76,47%. (c) Ranah Psikomotorik dari pra siklus sebesar 44,11% menjadi 79,41% pada siklus I dan pada siklus II meningkat menjadi 82,35%.Kata kunci : Project Based Learning, Aktivitas dan Kompetensi, Instalasi Sistem Operasi Berbasis GUI (Graphical User Interface) dan CLI ( Command Line Interface).",
    "id": 59,
    "title": "Penerapan Project Based Learning untuk Meningkatkan Aktivitas dan Kompetensi Instalasi Sistem Operasi Berbasis GUI dan CLI pada Siswa Kelas X TKJ di SMK N 1 Sawit"
  },
  {
    "abstract": "Penelitian ini bertujuan untuk : 1) Menghasilkan produk media pembelajaran interaktif pada mata kuliah teknik animasi 3D di PTIK UNS, dan 2) Mengetahui tingkat kelayakan dari media pembelajaran interaktif pada mata kuliah teknik animasi 3D di PTIK UNS.Metode penelitian yang digunakan adalah Research and Development yang mengacu pada prosedur pengembangan 4D. Penelitian ini meliputi 3 tahap yaitu tahap pendefinisian, tahap perencanaan, tahap pengembangan. Pada tahap pengembangan, validasi dilakukan oleh ahli materi dan ahli media serta terdapat penilaian dari pengguna kelompok kecil dan kelompok luas untuk mengetahui kelayakan pengunaan. Penelitian ini menggunakan teknik pengumpulan data dengan observasi dan wawancara sedangkan untuk teknik analisis data menggunakan deskriptif kualitatif dari data kuantitatif yang deperoleh dari lembar penilaian.Hasil penelitian dan pengembangan adalah: 1) menghasilkan media pembelajaran interaktif dengan menggunakan bahasa pemrograman java dan software Netbeans IDE. 2) Hasil penilaian tingkat kelayakan media pembelajaran interakti dari ahli materi 97% yang dikategorikan sangat layak, ahli materi memberikan penilaian 86%  yang dikategorikan sangat layak, penilaian kelompok kecil 79% dalam kategori layak dan pengguna kelompok luas memberikan penilaian 87% yang dikategorikan sangat layak.Kata Kunci : Pengembangan, Media Pembelajaran Interaktif, Java, Netbeans IDE, Teknik Animasi 3D.",
    "id": 60,
    "title": "Pengembangan Media Pembelajaran Interaktif pada Mata Kuliah Teknik Animasi 3 Dimensi di PTIK UNS dengan Menggunakan Java Netbeans"
  },
  {
    "abstract": "Penelitian ini bertujuan untuk menghasilkan sebuah sistem informasi pengelolaan nilai untuk memudahkan guru dalam mengelola nilai rapor siswa. Sistem informasi ini ditujukan untuk digunakan di Sekolah Menengah Kejuruan (SMK). Sistem informasi ini berbasis web, sehingga dapat diakses oleh guru untuk mengelola nilai dan siswa bisa melihat hasil belajarnya.Metode yang digunakan dalam penelitian ini adalah metode penelitian dan pengembangan (R&D) yang dilaksanakan di SMK Negeri 1 Kudus. Teknik pengumpulan data yaitu melalui wawancara, kuesioner dan dokumentasi. Pengembangan Sistem Informasi Akademik Berbasis Web Sebagai Sistem Pengolahan Nilai Siswa di SMK Negeri 1 Kudus dilaksanakan dengan lima tahap yaitu : (1) Communication merupakan diskusi antara peneliti dengan pihak sekolah tentang pengembangan sistem. (2) Planning merupakan tahap perancangan kebutuhan fungsional, kebutuhan software dan kebutuhan hardware dari sistem yang dikembangkan. (3). Modeling yaitu tahap perancangan sistem yang berfokus pada pemrosesan data. Tahap ini dimulai dengan pembuatan Usecase Diagram, Flowchart, DFD (Data Flow Diagram), ERD (Entity Relationship Diagram), Desain Tabel Basis Data dan Relasinya dan pembuatan Desain Tampilan Sistem. (4) Construction yaitu tahapan pada rancangan yang telah dibuat, di implementasikan ke dalam kode (program). (5) Deployment merupakan tahap pengujian kepada pihak SMK untuk mendapatkan umpan balik tentang kelayakan dan pengembangan sistem yang selanjutnya.Nilai akhir dari penelitian ini adalah 93,1% dari ahli sistem, 85,3% dari  guru dan staf tata usaha dan 82,4% dari siswa, sehingga dapat disimpulkan bahwa sistem ini sangat layak untuk digunakan.Kata Kunci : Sistem Informasi Akademik, berbasis web, pengelolaan nilai siswa",
    "id": 61,
    "title": "Pengembangan Sistem Informasi Akademik Berbasis Web Sebagai Sistem Pengolahan Nilai Siswa di SMK Negeri 1 Kudus"
  },
  {
    "abstract": "Penelitian ini bertujuan untuk menghasilkan sebuah aplikasi yang dapat membantu orang tua dan pihak sekolah dalam hal penyampaian informasi. Aplikasi ini berbasis Web dan SMS (Short Message Service). Aplikasi ini dapat menghubungkan orang tua murid dan sekolah melalui SMS yang dikirim.Penelitian ini dilakukan di SMK Negeri 1 Kudus dengan menggunakan teknik pengumpulan data seperti wawancara, menyebarkan lembar penilaian dan dokumentasi. Model yang digunakan dalam pembuatan Aplikasi Web Berbasis SMS sebagai media penyalur informasi dan komunikasi antara sekolah dengan orang tua siswa adalah Waterfall dengan langkah-langkah sebagai berikut : (1) Communication berupa diskusi awal antara peneliti dengan pihak sekolah. (2) Planning merupakan tahap perancangan kebutuhan software, kebutuhan hardware dan kebutuhan fungsionalitas. (3)Modeling yaitu tahap perancangan aplikasi yang berfokus pada pemrosesan data. Tahap ini dimulai dengan pembuatan Use case Diagram, Flowchart, DFD (Data Flow Diagram), ERD (Entity Relationship Diagram), Desain Tabel dan Relasinya, dan yang terakhir adalah pembuatan Desain Tampilan Aplikasi. (4)Construction yaitu tahap implementasi berdasarkan alur data dan alur aplikasi yang telah dibuat. (5)Deployment merupakan tahap pengujian kepada pihak SMK dengan bimbingan dari peneliti untuk mendapatkan masukan untuk pengembangan aplikasi yang selanjutnya.Hasil dari penelitian ini adalah aplikasi web berbasis SMS yang mampu mempermudah komunikasi antara sekolah dan orang tua siswa dengan hasil pengujian sebagai berikut : Dari ahli sistem 82,4, dari guru dan staf tata administrasi 81,6, dan dari orang tua 79,76. Sehingga dapat disimpulkan bahwa aplikasi ini layak untuk digunakan.Kata Kunci : SMS Gateway, berbasis web, penyalur informasi dan komunikasi, SMS",
    "id": 62,
    "title": "Pembuatan Aplikasi Web Berbasis SMS Sebagai Media Penyalur Informasi dan Komunikasi Antara Sekolah dengan Orang Tua Siswa"
  },
  {
    "abstract": "Penelitian ini bertujuan untuk mengetahui (1) perbedaan hasil belajar antara model pembelajaran flipped classroom berbantuan edmodo dengan pembelajaran konvensional pada mata pelajaran sistem operasi kelas X SMK Negeri 1 Banyudono, (2) efektivitas penggunaan model pembelajaran flipped classroom dalam meningkatkan hasil belajar sistem operasi siswa kelas X SMK Negeri 1 Banyudono.Penelitian ini menggunakan metode quasi eksperimental yaitu eskperimen yang memiliki perlakuan atau eksperimen semu. Penelitian ini dilakukan di SMK Negeri 1 Banyudono. Populasi penelitian ini adalah semua siswa kelas X TKJ SMK Negeri 1 Banyudono dengan banyak siswa pada kelas X TKJ 1 berjumlah 33 siswa dan X TKJ 2 berjumlah 30 siswa. Teknik sampling yang digunakan adalah total sampling. Teknik pengumpulan data menggunakan metode tes dan metode observasi, yaitu tes pada penilaian kognitif dan observasi dalam penilaian afektif dan psikomotorik pada mata pelajaran sistem operasi. Teknik analisis data yang digunakan adalah uji keseimbangan, uji normalitas dan uji homogenitas dengan taraf signifikansi 0,05, dan uji hipotesis dengan mengunakan uji t.Berdasarkan hasil penelitian dapat disimpulkan: (1) terdapat perbedaan hasil belajar antara model flipped classroom berbantuan edmodo dengan pembelajaran konvensional pada mata pelajaran sistem operasi kelas X SMK Negeri 1 Banyudono. Hal ini dibuktikan dari thitung: 2,208 > ttabel: 2,00 (2) penggunaan model pembelajaran flipped classroom berbantuan edmodo lebih efektif daripada pembelajaran konvensional dalam meningkatkan hasil belajar siswa kelas X SMK Negeri 1 Banyudono. Hal ini dibuktikan dari analisis indeks gain dengan nilai gain pada kelas eksperimen sebesar 0,512 dan kelas kontrol sebesar 0,288.Kata kunci: model flipped classroom, edmodo, pembelajaran konvensional, hasil belajar sistem operasi ",
    "id": 63,
    "title": "Perbandingan antara model pembelajaran flipped classroom berbantuan edmodo dengan pembelajaran konvensional terhadap hasil belajar sistem operasi  (eksperimen kelas x smk 1 Banyudono) "
  },
  {
    "abstract": "Penelitian ini bertujuan untuk meningkatkan kompetensi mendiagnosis jaringan yang diukur berdasarkan aspek afektif, kognitif dan psikomotorik melalui pendekatan CTL dengan menggunakan software simulasi Packet Tracer pada siswa kelas XI di SMK Negeri 1 Sawit tahun pelajaran 2015/2016.Bentuk penelitian ini adalah penelitian tindakan kelas (PTK), dilaksanakan dalam 2 siklus. Tiap siklus terdiri dari perencanaan, pelaksanaan, pengamatan dan refleksi. Subjek penelitian adalah siswa kelas XI TKJ 1 SMK Negeri 1 Sawit yang berjumlah 30 siswa, 8 siswa laki – laki dan 22 siswa perempuan. Teknik pengumpulan data yang digunakan adalah observasi, wawancara, tes, dan analisis dokumen. Teknik uji validitas yang digunakan adalah uji validitas ahli dan triangulasi sumber. Teknik analisis yang digunakan adalah teknik deskriptif komparatif dan teknik analisis kritis. Hasil penelitian tindakan kelas ini menunjukkan bahwa kompetensi siswa terhadap materi mendiagnosis jaringan meningkat melalui penerapan pendekatan CTL dan metode simulasi menggunakan software packet tracer. Peningkatan tersebut dapat dibuktikan dengan meningkatnya ketuntasan siswa pada tiap aspek. Pada aspek afektif, 13% atau 4 siswa tuntas pada prasiklus, 20% atau 6 siswa pada siklus 1 dan 100% atau 30 siswa tuntas. Pada aspek kognitif terdapat 26% atau 8 siswa tuntas pada siklus 1, 60% atau 18 siswa pada siklus 1, dan 97% atau 29 pada siklus 2. Pada aspek psikomotorik terdapat 77% atau 24 siswa tuntas pada prasiklus, 87% atau 26 siswa pada siklus 1, dan 100% atau 30 siswa pada siklus 2. Simpulan penelitian ini menunjukkan bahwa dengan penerapan pendekatan CTL dan metode simulasi menggunakan software simulasi packet tracer, dapat meningkatkan kompetensi diagnosis jaringan pada siswa kelas XI di SMK Negeri 1 Sawit tahun pelajaran 2015/2016.Kata kunci: CTL, diagnosis jaringan, kompetensi, simulasi",
    "id": 64,
    "title": "Upaya Peningkatan Kompetensi Diagnosis Jaringan  Melalui Pendekatan Contextual Teaching and Learning (Ctl) dengan Metode Simulasi Menggunakan Software Packet Tracer pada Siswa Kelas XI di SMK N 1 Sawit"
  },
  {
    "abstract": "Tujuan penelitian ini untuk mengembangan media pembelajaran videotutorial yang dapat digunakan untuk media bantu proses pembelajaran pada matapelajaran sistem operasi kelas X MM 1 SMK Negeri 6 Surakarta.Metode penelitian yang digunakan dalam penelitian ini adalah metodeRiset dan Pengembangan, yang berupa pengembangan media pembelajaranberbasis video tutorial dan mengujicobakan media tersebut di kelas X MM 1 SMKNegeri 6 Surakarta. Perancangan dilakukan dengan melalui prosedur analisis,desain, pengembangan, dan uji coba. Rangkaian pengembangan produk dilakukandengan mencakup menentukan materi dan kebutuhan, merancang layout danstoryboard, pengambilan video, screencapturing video, dan editing video, sertauji coba terbatas, uji coba diperluas dan revisi produk. Teknik analisis data yangdigunakan dalam penelitian ini adalah teknik analisis deskriptif dengan mengubahdata hasil rata-rata penilaian interval skor.Hasil penelitian ini menunjukkan bahwa penilaian pakar atau ahli materiyang menyatakan bahwa media pembelajaran video tutorial memenuhi kriteriabaik dengan persentase sebesar 78,7%. Penilaian ahli media terhadap mediapembelajaran video tutorial dengan persentase keseluruhan sebesar 87,5% yangmemenuhi kriteria baik sekali. Penilaian praktisi pembelajaran terhadap mediapembelajaran video tutorial dengan persentase keseluruhan sebesar 83,6% yangmemenuhi kriteria baik sekali. Tanggapan oleh siswa kelas X MM 1 SMK Negeri6 Surakarta memperoleh keseluruhan persentase sebesar 90% yang memenuhikriteria baik sekali. Hasil penelitian dapat disimpulkan bahwa media pembelajaranvideo tutorial yang dikembangkan layak dan dapat digunakan pada prosespembelajaran mata pelajaran sistem operasi kelas X MM SMK Negeri 6Surakarta.Kata Kunci: media pembelajaran, video tutorial, pembelajaran sistemoperasi, multimedia pembelajaran, open source operating system.",
    "id": 65,
    "title": "Pengembangan Media Pembelajaran Video Tutorial pada Mata Pelajaran Sistem Operasi Kelas X Multimedia SMK Negeri 6 Surakarta Tahun Ajaran 2015/2016"
  },
  {
    "abstract": "Penelitian ini bertujuan untuk menguji ada tidaknya (1) perbedaan pengaruh penerapan model pembelajaran Discovery Learning dengan model Project Based Learning yang dikombinasikan teknik College Ball terhadap prestasi belajar peserta didik pada materi Kontrol Percabangan; (2) perbedaan pengaruh minat peserta didik terhadap prestasi belajar Kontrol Percabangan; dan (3) interaksi pengaruh antara penerapan model pembelajaran dengan minat terhadap prestasi belajar peserta didik pada materi Kontrol Percabangan. Populasi dalam penelitian ini adalah seluruh siswa kelas X MM di SMK Negeri 6 Surakarta. Sampel dalam penelitian ini sudah mencakup keseluruhan populasi yaitu kelas X MM 1 dan X MM 2. Penelitian ini menggunakan metode Eksperimen Semu Postest Only Control Group Design. Pengumpulan data dilaksanakan dengan pengambilan angket untuk data minat dan teknik tes untuk data prestasi belajar peserta didik. Analisis data menggunakan uji anava dua jalan dengan model faktorial, kemudian dilanjutkan dengan uji komparasi ganda menggunakan rumus Scheffe dengan taraf signifikansi 0,05. Hasil penelitian adalah sebagai berikut ini. Pertama, tidak ada perbedaan pengaruh yang signifikan antara model Discovery Learning dan model Project Based Learning kombinasi teknik College Ball terhadap prestasi belajar siswa, walaupun tidak terdapat pengaruh yang positif dan signifikan rata-rata nilai prestasi belajar peserta didik dengan model Project Based Learning kombinasi teknik College Ball memiliki nilai rata-rata yang lebih baik dibandingkan dengan siswa yang diberi pembelajaran dengan model Discovery Learning. Kedua, ada perbedaan pengaruh yang signifikan antara minat belajar peserta didik terhadap prestasi belajar peserta didik, dimana minat tinggi memberikan prestasi belajar yang lebih baik daripada minat rendah. Untuk minat belajar peserta didik kategori tinggi dan sedang memberikan pengaruh yang sama terhadap prestasi belajar, hal yang sama juga terjadi pada minat sedang dan rendah. Ketiga, tidak ada interaksi pengaruh antara penerapan model pembelajaran dengan minat peserta didik bersama-sama terhadap prestasi belajar siswa. Kata Kunci : discovery learning, project based learning, college ball, minat, prestasi belajar",
    "id": 66,
    "title": "Eksperimentasi Discovery Learning dan Project Based Learning Kombinasi College Ball ditinjau dari Minat pada Materi Kontrol Percabangan Kelas X SMK Negeri 6 Surakarta Tahun Ajaran 2015/2016"
  },
  {
    "abstract": "Penelitian ini bertujuan untuk mengembangkan modul interaktif pada mata pelajaran simulasi digital dan mengetahui kelayakan modul interaktif berdasarkan penilaian ahli materi, ahli media, dan praktisi pembelajaran. Metode penelitian yang digunakan dalam penelitian ini adalah Penelitian dan Pengembangan (Research and Development). Pengembangan modul interaktif dilakukan dalam beberapa tahap. Tahap pertama yang dilakukan dalam penelitian ini adalah analisis isi materi dan analisis kebutuhan. Tahapan selanjutnya dari penelitian ini adalah pembuatan peta navigasi dan storyboard. Tahapan terakhir adalah pembuatan media, memvalidasi, merevisi, publishing, dan mengujicoba. Hasil penelitian menunjukkan bahwa modul interaktif memiliki skor 97% dari ahli materi yang termasuk dalam kategori sangat layak, 79% dari ahli media yang termasuk dalam kategori layak, dan 97% dari praktisi pembelajaran yang termasuk dalam kategori sangat layak.",
    "id": 67,
    "title": "Pengembangan Modul Interaktif Berbasis Adobe Flash pada Kompetensi Dasar Pengolah Simulasi Visual  Tahap Pasca Produksi Kelas X Akuntansi 3                           SMK Negeri 6 Surakarta"
  },
  {
    "abstract": "Penelitian ini bertujuan untuk mengetahui (1) pengaruh computer literacy terhadap minat mencari kerja pada siswa kelas XII di Sekolah Menengah Kejuruan Kabupaten Wonogiri Tahun Pelajaran 2015/2016; (2) pengaruh intensitas penggunaan website sebagai media informasi terhadap minat mencari kerja pada siswa kelas XII di Sekolah Menengah Kejuruan Kabupaten Wonogiri Tahun Pelajaran 2015/2016; (3) pengaruh computer literacy dan intensitas penggunaan website sebagai media informasi terhadap minat mencari kerja pada siswa kelas XII di Sekolah Menengah Kejuruan Kabupaten Wonogiri Tahun Pelajaran 2015 / 2016. Populasi dalam penelitian ini adalah siswa kelas XII SMK di Kabupaten Wonogiri tahun pelajaran 2015/2016. Penelitian ini merupakan penelitian kuantitatif dengan metode survei. Pengumpulan data menggunakan metode angket dan dokumentasi. Analisis data menggunakan regresi tunggal untuk menguji hipotesis 1 dan 2, dan regresi ganda untuk menguji hipotesis 3. Hasil penelitian ini adalah sebagai berikut ini. Pertama, terdapat pengaruh yang positif dan signifikan computer literacy terhadap minat mencari kerja pada siswa kelas XII di Sekolah Menengah Kejuruan Kabupaten Wonogiri tahun pelajaran 2015/2016 yang ditunjukkan dengan koefisien korelasi (r ) sebesar 0,249, koefisien determinasi (r 2 x1y ) sebesar 0,062 dan t (3,289>1,97) pada taraf signifikansi 5%. Kedua, terdapat pengaruh yang positif dan signifikan intensitas penggunaan website sebagai media informasi terhadap minat mencari kerja pada siswa kelas XII di Sekolah Menengah Kejuruan Kabupaten Wonogiri tahun pelajaran 2015/2016 yang ditunjukkan dengan koefisien korelasi (r x1y ) sebesar 0,316, koefisien determinasi (r 2 x1y ) sebesar 0,100 dan t hitung >t (4,250>1,97), pada taraf signifikansi 5%. Ketiga, terdapat pengaruh yang positif dan signifikan computer literacy dan intensitas penggunaan website sebagai media informasi secara bersama–sama terhadap minat mencari kerja pada siswa kelas XII Sekolah Menengah Kejuruan di Kabupaten Wonogiri dengan koefisien determinasi (R tabel 2 ) sebesar 0,13 dan F hitung >F (12,164>3,05), pada taraf signifikansi 5%",
    "id": 68,
    "title": "Pengaruh Computer Literacy  dan  Intensitas  Penggunaan  Website Sebagai  Media  Informasi   Terhadap  Minat  Mencari  Kerja  pada  Siswa  Kelas XII di Sekolah Menengah Kejuruan Kabupaten Wonogiri  Tahun Pelajaran 2015/2016"
  },
  {
    "abstract": "Penelitian ini bertujuan untuk meningkatkan pemahaman konsep dasaralgoritma pemrograman siswa kelas X TKJ 1 SMK N 1 Banyudono padapembelajaran Pemrograman Dasar melalui model pembelajaran Problem BasedLearning menggunakan aplikasi Robomind.Penelitian ini merupakan Penelitian Tindakan Kelas, dengan subjekpenelitian yaitu siswa kelas X TKJ 1 SMK N 1 Banyudono sejumlah 33 siswa.Penelitian diawali dengan mengidentifikasi masalah yang terjadi di dalam kelas.Kemudian dirancang suatu tindakan untuk mengatasinya dalam sebuah siklustindakan. Pada penelitian ini pemberian tindakan berlangsung dalam dua siklus.Setiap siklus terdiri atas tahap perencanaan, pelaksanaan, pengamatan, danrefleksi.. Teknik pengumpulan data dilakukan melalui observasi kegiatanpembelajaran di kelas dan tes pemahaman setelah tindakan tiap siklusnya. Analisaterhadap data dilakukan menggunakan teknik analisis kuantitatif dan kualitatifinteraktif.Hasil penelitian menunjukan bahwa penerapan model pembelajaranProblem Based Learning menggunakan bantuan media aplikasi Robomind dapatmeningkatkan pemahaman siswa terhadap algoritma program. Hal tersebutditunjukan dengan persentase ketuntasan siswa dalam tes pemahaman sebesar37,5 % pada pra siklus, 44,8 % pada siklus I, dan 93,3 % pada siklus II.Kata Kunci : penelitian tindakan kelas, pemahaman konsep dasar algoritma,problem based learning, robomind ",
    "id": 69,
    "title": "Upaya peningkatan pemahaman konsep dasar algoritma pemrograman menggunakan aplikasi robomind melalui model problem based learning pada mata pelajaran pemrograman dasar siswa kelas x tkj 1 smk n 1 Banyudono"
  },
  {
    "abstract": "ABSTRAKPenelitian  ini  bertujuan  untuk  membuat  media  pembelajaran  Subnettingberbasis web dan mengetahui kelayakan media pembelajaran Subnetting berbasisweb  yang dibuat. Penilaian kualitas media pembelajaran dilihat dari  segi media,materi dan dari segi pengguna.Metode  penelitian  yang  digunakan  adalah  pengembangan  atau  dikenaldengan  metode  Research  and  Development  (R&D).  Model  pengembanganmengacu  pada  Waterfall  model  oleh  Pressman  mengenai  pengembangan  suatuperangkat  lunak.  Pada  tahap  desain  berupa  pembuatan  rancangan  mediapembelajaran antara lain rancangan usecase, rancangan flowchart, rancangan dataflow  diagram  (DFD),  rancangan  entity  relationship  diagram  (ERD),  rancangandatabase,  dan  rancangan  desain. Tahap  Pengujian  yang  dilakukan  dibagi  dalamdua tahap yaitu alpha testing yang dilakukan oleh ahli media dan ahli materi sertabeta  testing  yang  dilakukan  oleh  siswa  kelas  X  TKJ  SMK  Taruna  Kradenan.Instrumen penelitian menggunakan angket tertutup dan angket terbuka. Pengujiandilakukan untuk mengetahui kualitas media pembelajaran yang dikembangkan.Pengembangan  yang  dilakukan  menghasilkan  produk  berupa  mediapembelajaran  Subnetting  berbasis  web.  Proses  pengembangan  terdiri  dari  (1)analisis,  (2)  desain  yang  dibagi  menjadi  2  yaitu  desain  program  dan  desaintampilan,  (3)  implementasi berupa proses koding  (4) pengujian berupa penilaiankualitas media  dan  (5)  proses  perbaikan  dan  perawatan media.  Hasil  penilaiandalam skala likert media pembelajaran yang dikembangkan adalah sebagai berikut:  (1)  Penilaian  ahli  media  menunjukkan  bahwa  website  telah  sesuai  dengankriteria  penilaian,  nilai    akhir    dari   media    pembelajaran  interaktif  adalah  90%dengan  tingkat kelayakan “sangat  layak”.  (2) Total kriteria penilaian dalam  segimateri  terhadap  media  pembelajaran  interaktif  adalah  90%  dengan  tingkatkelayakan “sangat  layak”. (3) Penilaian pengguna yang dilakukan secara 2  tahapyaitu  skala  kecil  dan  skala  besar  secara  langsung  kepada  guru  dan  siswa. Datapenilaian pengguna Skala Kecil yang merupakan hasil penilaian terhadap 2 orangguru dan 5 orang  siswa pada media pembelajaran  subnetting menunjukan angkasebesar  88%  tingkat  kelayakan  “Sangat  layak”.  Berdasarkan  data  penilaian  pengguna    skala  besar  yang merupakan  hasil  penilaian  terhadap  21  siswa  TKJkelas  X  SMK  Taruna  Kradenan  yaitu  menunjukan  presentase  86,7%    tingkatkelayakan  “Sangat  Layak”.  Dengan  demikian  hasil  dari  keseluruhan  penilaiandilihat  pada  tiga  segi  aspek  tersebut,  dapat  disimpulkan  bahwa  mediapembelajaran subnetting berbasis web yang dibangun mempunyai kelayakan yangbaik. Sehingga dapat digunakan sebagai media pembelajaran. Kata Kunci : media pembelajaran, subnetting, berbasis web ",
    "id": 70,
    "title": "Pembuatan Media Pembelajaran Interaktif Berbasis Web dengan Menggunakan Html5 pada Materi Subnetting Kelas X Tkj Smk Taruna Kradenan"
  },
  {
    "abstract": "Penelitian ini bertujuan untuk meningkatkan kompetensi (1) kognitif; (2)psikomotorik; (3) afektif pada mata pelajaran pemrograman dasar setelahmenggunakan model kooperatif tipe STAD berlatar musik klasik;Penelitian ini merupakan penelitian tindakan kelas dengan pelaksanaanselama 2 siklus. Penelitian ini menggunakan model kooperatif tipe STAD denganlatar musik klasik. Subjek penelitian ini adalah seluruh siswa kelas X Multimedia1 di SMK Negeri 3 Surakarta. Penggumpulan data dilakukan dengan teknikobservasi untuk data kompetensi afektif peserta didik, teknik tes untuk datakompetensi kognitif dan psikomotorik, dan teknik angket untuk data efektivitasmusik klasik dalam pembelajaran terhadap ketenangan dan konsentrasi. Analisisdata yang digunakan adalah analisis data diskriptif komparatif.Hasil penelitian sebagai berikut. (1) peningkatan kompetensi kognitif pesertadidik belum mencapai indikator (Pratindakan 0%, Siklus I 18.518%, dan Siklus II10%). (2) peningkatan kompetensi psikomotorik peserta didik mencapai indikator(Pratindakan 33.33%, Siklus I 74.074%, dan Siklus II 76.67%). (3) peningkatanpada kompetensi afektif peserta didik mencapai indikator (Pratindakan 40%,Siklus I 53.125%, dan Siklus II 80%).Kata Kunci: Kompetensi, model kooperatif, Musik Klasik, Pemrograman Dasar,STAD",
    "id": 71,
    "title": "Peningkatan Kompetensi Peserta Didik pada Mata Pelajaran Pemrograman Dasar Menggunakan Model Kooperatif Tipe Stad Berlatar Musik Klasik Kelas X Multimedia 1 SMK Negeri 3 Surakarta"
  },
  {
    "abstract": "Tujuan penelitian ini adalah untuk mengetahui hasil belajar peserta didik pada mata pelajaran Pemrograman Web dengan materi pembuatan formulir halaman web melalui model pembelajaran kooperatif tipe STAD pada peserta didik kelas X RPL A SMK Negeri 2 Karanganyar tahun pelajaran 2015/2016. Penelitian ini adalah Penelitian Tindakan Kelas (PTK) dengan menggunakan model pembelajaran kooperatif tipe STAD (Student Team Achievement Division) dalam mata pelajaran pemrograman web dengan kompetensi dasar menyajikan formulir pada halaman web. Materi pokok yang diajarkan adalah memahami dan menyajikan format formulir pada halaman web. Penelitian ini dilakukan pada bulan Maret hingga Mei 2016 dengan dua siklus. Setiap siklus terdiri atas perencanaan, pelaksanaan tindakan, observasi dan refleksi. Subyek dalam penelitian ini peserta didik kelas X RPL A SMK Negeri 2 Karanganyar tahun pelajaran 2015/2016 berjumlah 36 peserta didik yang terdiri dari 30 orang putra dan 6 orang putri. Pengumpulan data dilakukan dengan menggunakan teknik dokumentasi, teknik wawancara, dan teknik tes tertulis untuk aspek kognitif, aspek psikomotor dan aspek afektif dalam bentuk lembar observasi. Teknik analisis data yang digunakan dalam penelitian ini adalah secara deskriptif komparatif dengan persentase. Peningkatan hasil belajar peserta didik baik dari aspek kognitif, afektif maupun psikomotor dalam pembelajaran pemrograman web dengan menggunakan model pembelajaran kooperatif tipe STAD (Student Team Achievement Division) sebagai berikut 1) Capaian pada aspek kognitif pada observasi awal 33,33%, menjadi 75% pada siklus I dan meningkat menjadi 86,11% pada siklus II. 2) Capaian pada aspek afektif pada observasi awal 61,67%, menjadi 78,68% pada siklus I dan meningkat menjadi 87,01% pada siklus II. 3) Capaian pada aspek psikomotor pada observasi awal 42,16%, menjadi 68,50% pada siklus I dan meningkat menjadi 82,04% pada siklus II. Berdasarkan hasil penelitian dapat disimpulkan bahwa penerapan model pembelajaran kooperatif tipe STAD (Student Team Achievement Division) dapat meningkatkan hasil belajar peserta didik pada materi pokok formulir halaman web mata pelajaran pemrograman web kelas X RPL A SMK Negeri 2 Karanganyar tahun pelajaran 2015/2016",
    "id": 72,
    "title": "Penerapan Model Pembelajaran Kooperatif Tipe STAD untuk Meningkatkan Hasil Belajar Peserta Didik   pada Mata Pelajaran Pemrograman Web  Kelas X RPL A di SMKN 2 Karanganyar"
  },
  {
    "abstract": "Penelitian ini bertujuan untuk membangun aplikasi pembuatan laporan praktikum yang berguna untuk memudahkan siswa dalam membuat laporan praktikum. Aplikasi ini dibuat untuk digunakan di lembaga pendidikan, terutama pada siswa Sekolah Menengah Kejuruan (SMK) yang sering terjun untuk melakukan praktik. Aplikasi ini berbasis web yang langsung terkoneksi dengan guru, sehingga hasil laporan siswa dapat dilihat dan dinilai oleh guru. Metode yang digunakan dalam penelitian ini adalah metode penelitian dan pengembangan (R&D) menggunakan model pengembangan Borg & Gall. Penelitian ini dilaksanakan di SMK Negeri 1 Sawit. Teknik pengumpulan data yaitu melalui wawancara, menyebarkan lembar penilaian dan dokumentasi. Rancang bangun aplikasi pembuatan laporan praktikum berbasis web pada SMK melalui sepuluh tahap yaitu: (1) Potensi dan masalah. (2) Pengumpulan data. (3) Desain produk, berupa membuat rancangan use case diagram, flowchart, DFD, ERD, pembuatan desain tampilan, pembuatan basis data dan pembuatan aplikasi. (4) Validasi desain, berupa pengujian yang dilakukan oleh ahli media. (5) Revisi desain, yaitu revisi dari ahli media. (6) Uji coba produk, berupa pengujian perorangan. (7) Revisi produk, yaitu revisi tahap I. (8) Uji coba pemakaian, berupa pengujian oleh kelompok kecil. (9) Revisi produk, yaitu revisi tahap II. (10) Produk akhir aplikasi, yaitu hasil akhir aplikasi pembuatan laporan praktikum berbasis web pada SMK. Hasil penelitian dari aplikasi pembuatan laporan praktikum mendapatkan nilai dalam bentuk persentase sebesar 89% dari ahli media, 91% dari kelompok kecil dan 81% dari kelompok luas. Sehingga, aplikasi pembuatan laporan praktikum berbasis web pada SMK masuk dalam kategori sangat layak digunakan dalam pembuatan laporan praktikum.",
    "id": 73,
    "title": "Rancang Bangun Aplikasi Pembuatan Laporan Praktikum  Berbasis Web pada SMK"
  },
  {
    "abstract": "Tujuan penelitian ini adalah untuk (1) Mengetahui peningkatan hasil belajar peserta didik Kelas XI RPL B SMK Negeri 2 Karanganyar dengan penerapan model pembelajaran Project Based Learning pada Mata Pelajaran Pemrograman Desktop, (2) Mengetahui peningkatan keaktifan peserta didik Kelas XI RPL B SMK Negeri 2 Karanganyar dengan penerapan model pembelajaran Project Based Learning pada Mata Pelajaran Pemrograman Desktop.Penelitian ini merupakan Penelitian Tindakan Kelas (PTK) yang dilaksanakan dalam 2 siklus, tetapi sebelumnya terlebih dahulu dilaksanakan tahap prasiklus. Setiap siklus terdiri dari 4 tahap yaitu perencanaan, pelaksanaan tindakan, observasi, dan refleksi. Subjek penelitian adalah peserta didik kelas XI RPL B SMK Negeri 2 Karanganyar Tahun Pelajaran 2015/2016 yang terdiri dari 34 peserta didik dengan laki-laki sejumlah 28 peserta didik dan perempuan sejumlah 6 peserta didik. Teknik pengumpulan data yang digunakan adalah dokumentasi, observasi, tes, dan wawancara. Teknik uji validitas data yang digunakan adalah triangulasi dan teknik analisis data yang digunakan adalah statistik deskriptif komparatif.Hasil penelitian membuktikan bahwa penerapan model pembelajaran Project Based Learning dapat meningkatkan hasil belajar dan keaktifan peserta didik. Hasil penelitian menunjukkan peningkatan persentase ketuntasan peserta didik pada ranah kognitif prasiklus 33,33%, siklus I 40,00%, dan siklus II 96,97%; ranah afektif prasiklus 3,03%, siklus I 56,25%, dan siklus II 84,85%; ranah psikomotorik prasiklus 0,00%, siklus I 40,63%, dan siklus II 81,82%; serta keaktifan prasiklus 6,06%, siklus I 50,00%, dan siklus II 93,94%. Hasil wawancara dengan peserta didik menunjukkan bahwa penerapan model pembelajaran Project Based Learning menyenangkan dan membuat peserta didik lebih aktif dalam proses pembelajaran. Simpulan dari penelitian ini adalah penerapan model pembelajaran Project Based Learning pada mata pelajaran Pemrograman Desktop dapat meningkatkan hasil belajar dan keaktifan peserta didik Kelas XI RPL B SMK Negeri 2 Karanganyar Tahun Pelajaran 2015/2016.Kata Kunci : project based learning, pemrograman desktop, hasil belajar, keaktifan, ketuntasan ",
    "id": 74,
    "title": "Penerapan model pembelajaran project based learning (pbl) pada mata pelajaran pemrograman desktop untuk meningkatkan hasil belajar peserta didik kelas xi rpl b smk negeri 2 Karanganyar"
  },
  {
    "abstract": "Tujuan dari penelitian ini adalah untuk mengetahui (1) perbedaan prestasi belajar siswa antara kelas kontrol dengan kelas eksperimen yang diberikan treatment penggunaan e-learning berbasis schoology dengan menggunakan model discovery learning; (2) efektivitas penggunaan e-learning berbasis schoology dengan menggunakan model discovery learning dalam meningkatkan prestasi belajar siswa.Populasi penelitian ini adalah siswa kelas X multimedia SMK Negeri 6 Surakarta. Teknik pengambilan sampel yang digunakan random sampling. Metode penelitian ini menggunakan quasi eksperimental. Teknik pengumpulan data pada penelitian ini menggunakan metode observasi untuk mengetahui pengelolaan pembelajaran sebelum dan sesudah diberikan treatmen penggunaan e-learning berbasis schoology dengan menggunakan model discovery learning. Metode dokumentasi untuk mengetahui daftar nama, jumlah siswa, nilai harian serta bukti penelitian dengan menggunakan pengambilan gambar. Metode tes untuk mengetahui hasil pretest dan posttest. Analisis data yang digunakan uji non parametrik menggunakan mann whitney test dan wilcoxon sign rank test.Berdasarkan hasil penelitian, pertama terdapat perbedaan nilai posttest antara kelas kontrol dan kelas eksperimen setelah diberikan treatment berupa penggunaan e-learning berbasis schoology menggunakan model discovery learning, nilai sig lebih kecil dari taraf signifikan 0,05 yaitu 0,000 <!--[if gte msEquation 12]><                    <![endif]--&gt;&lt;!--[if !vml]--&gt;&lt;!--[endif]--&gt;&lt;!--[endif]--&gt;&nbsp;0,05. Kedua penggunaan &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<em>e-learning berbasis schoology menggunakan model discovery learning lebih efektif, dengan peningkatan nilai gain sebesar 0,94. Sedangkan pembelajaran konvensional memberikan peningkatan nilai gain sebesar 0,74.   Kata Kunci : Efektivitas, E-learning, Schoology, Model discovery learning, Prestasi belajar siswa",
    "id": 75,
    "title": "Efektivitas Penggunaan E-Learning Berbasis Schoology dengan Menggunakan Model Discovery Learning Terhadap Prestasi Belajar Siswa pada Mata Pelajaran Sistem Komputer Kelas X Multimedia SMK Negeri 6 Surakarta pada Tahun Pelajaran 2015/2016"
  },
  {
    "abstract": "ABSTRAKTujuan Penelitian ini adalah untuk mengembangkan Sistem Informasi Administrasi Program Studi Berbasis Web pada Program Pascasarjana FKIP UNS, sehingga mengelola jadwal kuliah, peminjaman ruang, data fasilitas ruang, mata kuliah dan dosen agar terdigitalisasi serta mudah diakses. Metode penelitian yang di gunakan dalam penelitian ini adalah metode riset dan pengembangan (Research and development). Penelitian ini dilaksanakan di Program Pascasarjana FKIP Universitas Sebelas Maret Surakarta. Pengumpulan data menggunakan metode observasi, metode dokumentasi dan metode literature atau kepustakaan. Pengembangan Sistem Informasi Program Studi dilakukan dengan menempuh beberapa tahap. Tahap pertama dilakukan dengan analisis kebutuhan sistem, merancang flowchart, merancang ERD dan merancang DFD. Tahap kedua adalah tahap pengembangan yaitu pembuatan desain tampilan, pembuatan database dan pembuatan sistem. Tahap ketiga yaitu tahap pengujian oleh beberapa ahli dengan menggunakan instrumen uji coba sistem dilanjutkan dengan revisi sistem. Hasil penelitian ini menunjukan bahwa produk Sistem Informasi Administrasi Program Studi yang dikembangkan memiliki penilaian sebesar 88.4 dari ahli sistem informasi, 86.6 dari ahli substansi administrasi dan 83.5 dari admin prodi (pengguna), sehingga masuk dalam kategori sangat layak digunakan dalam administrasi program studi. Kata Kunci : sistem informasi, administrasi program studi, berbasis web",
    "id": 76,
    "title": "Pengembangan Sistem Informasi Administrasi Program Studi Berbasis Web pada Program Pascasarjana  FKIP UNS   "
  },
  {
    "abstract": "Penelitian ini bertujuan untuk mengetahui apakah (1) penerapan simulatorCisco Packet Tracer dengan model pembelajaran TGT dalam mata pelajaranJaringan Dasar dapat meningkatkan hasil belajar siswa, (2) penerapan simulatorCisco Packet Tracer dengan model pembelajaran TGT dalam mata pelajaranJaringan Dasar dapat meningkatkan keaktifan siswa. Jenis penelitian ini adalah Penelitian Tindakan Kelas. Penelitian ini terdiridari 2 siklus, dengan masing-masing siklus terdiri dari beberapa tahap yakniperencanaan, pelaksanaan tindakan, observasi, dan refleksi yang dimulai daribulan April sampai Mei 2016. Subjek penelitian ini adalah siswa kelas X TKJ 1Sekolah Menengah Kejuruan Negeri 1 Banyudono tahun ajaran 2015/2016 yangberjumlah 33 siswa. Teknik pengumpulan data meliputi observasi, tes, wawancaradan dokumentasi. Validasi data dilakukan dengan cara triangulasi. Analisis datakualitatif dilakukan dengan teknik analisis kritis yang terdiri dari reduksi,penyajian, verifikasi, penarikan kesimpulan, sedangkan data kuantitatif dianalisisdengan teknik statistik deskriptif komparatif. Hasil penelitian menunjukkan bahwa penerapan simulator Cisco PacketTracer dengan model pembelajaran TGT dalam mata pelajaran Jaringan Dasardapat meningkatkan hasil belajar siswa. Peningkatan persentase ketuntasan hasilbelajar siswa ranah kognitif dari pra tindakan 24,24%, siklus I 60,61%, dan siklusII 75,76%. Peningkatan persentase ketuntasan hasil belajar siswa ranah afektifdari pra tindakan 51,52%, siklus I 75,76%, dan siklus II 87,88%. Peningkatanpersentase ketuntasan hasil belajar siswa ranah psikomotorik dari pra tindakan24,24%, siklus I 72,73%, dan siklus II 84,85%. Penerapan simulator Cisco PacketTracer dengan model pembelajaran TGT dalam mata pelajaran Jaringan Dasardapat meningkatkan keaktifan siswa. Peningkatan persentase keaktifan kelas daripra tindakan 33,94%, siklus I 68,48%, dan siklus II 77,58%. Berdasarkan hasilpenelitian, dapat disimpulkan bahwa penerapan simulator Cisco Packet Tracerdengan model pembelajaran TGT dalam mata pelajaran Jaringan Dasar dapatmeningkatkan hasil belajar dan keaktifan siswa kelas X TKJ 1 SMK Negeri 1Banyudono tahun ajaran 2015/2016.  ",
    "id": 77,
    "title": "Penerapan Simulator Cisco Packet Tracer dengan Model Pembelajaran Teams Games Tournament  untuk Meningkatkan Hasil Belajar dan Keaktifan Jaringan Dasar Kelas X TKJ  SMK Negeri 1 Banyudono"
  },
  {
    "abstract": "Penelitian ini bertujuan untuk mengetahui ada tidaknya (1) pengaruhpenggunaan smartphone terhadap hasil belajar kognitif siswa kelas X TKJ SMKNegeri 1 Sukoharjo; (2) pengaruh intensitas bermain game terhadap hasil belajarkognitif siswa kelas X TKJ SMK Negeri 1 Sukoharjo; (3) Adakah interaksipenggunaan smartphone dan intensitas bermain game terhadap hasil belajarkognitif siswa kelas X TKJ SMK Negeri 1 Sukoharjo; dan (4) penggunaansmartphone ataukah intensitas bermain game yang mempunyai sumbangan lebihbesar terhadap hasil belajar kognitif siswa kelas X TKJ SMK Negeri 1 Sukoharjo. Penelitian ini menggunakan metode ex-post facto. Pengumpulan datadilakukan dengan teknik angket untuk data penggunaan smartphone dan intensitasbermain game sedangkan teknik dokumentasi untuk data hasil belajar kognitifsiswa. Analisis data menggunakan uji regresi sederhana dan uji regresi bergandakemudian dilanjutkan dengan uji t-parsial, uji F dan menghitung sumbanganrelatif serta sumbangan efektif. Populasi dalam penelitian ini adalah siswa kelas XTKJ SMK Negeri 1 Sukoharjo. Sampel yang terpilih adalah 61 siswa dari kelas XTKJ A dan X TKJ B dengan teknik pengambilan sampel random sampling. Hasil penelitian adalah sebagai berikut ini. Pertama, ada pengaruhpenggunaan smartphone terhadap hasil belajar kognitif siswa kelas X TKJ SMKNegeri 1 Sukoharjo (t hitung=2,214>t tabel=2,001). Penggunaan smartphoneberpengaruh positif (searah) dan signifikan terhadap hasil belajar kognitif siswa.Penggunaan smartphone yang dimaksudkan adalah penggunaan dengan arahpositif yaitu menggunakan smartphone untuk kegiatan yang bersifat positif.Kedua, ada pengaruh signifikan antara intensitas bermain game terhadap hasilbelajar kognitif siswa kelas X TKJ SMK Negeri 1 Sukoharjo (t hitung=2,841> ttabel=2,001). Intensitas bermain game berpengaruh negatif (tidak searah) dansignifikan terhadap hasil belajar kognitif siswa. Ketiga, ada interaksi signifikanantara penggunaan smartphone dan intensitas bermain game terhadap hasil belajarkognitif siswa kelas X TKJ SMK Negeri 1 Sukoharjo (F hitung=7,790>Ftabel=3,156). Dalam interaksi pengaruh, penggunaan smartphone mempunyaipengaruh positif (searah) terhadap hasil belajar siswa, sedangkan intensitasbermain game mempunyai pengaruh negatif (tidak searah) terhadap hasil belajarsiswa. Keempat, intensitas bermain game memiliki pengaruh yang lebih tinggiterhadap hasil belajar siswa dibandingkan variabel penggunaan smartphone.Penggunaan smartphone memberikan sumbangan efektif 8,42% dengan pengaruhyang positif, sedangkan variabel intensitas bermain game memberikan sumbanganefektif 12,77% dengan pengaruh yang negatif.",
    "id": 78,
    "title": "Pengaruh Penggunaan Smartphone dan Intensitas Bermain Game Terhadap Hasil Belajar Kognitif   Siswa Kelas X SMK Negeri 1 Sukoharjo"
  }
]
