[
  {
    "id": "85213",
    "judul": "Pengaruh Penggunaan Tepung Telur Infertil dalam Ransum terhadap Bobot Potong, Bobot Karkas, dan Lemak Abdominal Ayam Broiler",
    "abstrak": "STEAM (Science, Technology, Engineering, Arts, and Mathematic) merupakan sebuahrekonseptualisasi dari STEM, di mana dilakukan penambahan satu elemen di dalamnya, yaitu Arts atauseni yang berperan dalam meningkatkan kinerja lintas disiplin dari proyek yang sedang dijalankansehingga dapat memunculkan gagasan serta solusi kreatif yang baru. Dengan memfokuskan seni dalamkurikulum pembelajaran, penggunaan media robotika dapat melengkapi dan meningkatkan variasikreativitas yang terbentuk di dalam kelas, serta mampu memperbarui dan memperluas ilmupengetahuan dalam kegiatan pembelajaran. Pengembangan media pembelajaran ini diharapkan dapatmemberikan pengaruh serta keuntungan dalam kegiatan pembelajaran pada anak. Tujuan: Untukmenelaah hasil dari berbagai penelitian terkait pengaruh penggunaan media robotika terhadap metodepembelajaran STEAM pada anak serta memberikan gambaran lebih dalam mengenai kelebihanpenggunaan media pembelajaran robotika. Metode: Penelitian ini menggunakan metode literaturereview yang dilakukan selama bulan November 2020 – September 2021. Penelurusan literaturdilakukan dengan menggunakan Scopus, ScienceDirect, Microsoft Academic, dan GoogleScholarsebagai database. Hasil: Sebanyak 44 literatur yang sesuai dengan kriteria inklusi yang mampumenjawab rumusan pertanyaan penelitian dilakukan telaah lebih lanjut. Simpulan: Berdasarkan temuandari literatur yang telah ditinjau, didapatkan bahwa penggunaan media robotika dalam pembelajaranSTEAM pada anak memiliki berbagai manfaat dan peran positif dalam berbagai aspek pendidikan, yaituterkait perkembangan soft skills pada anak, membantu siswa mengembangkan gagasan dan kreativitasmereka dengan menghubungkan ilmu-ilmu pengetahuan yang telah mereka ketahui dalam berbagaibidang, serta mendorong siswa untuk berperan lebih aktif dalam kegiatan pembelajaran. Selain itu,penggunaan media robotika dalam pembelajaran STEAM juga memiliki beberapa kelebihan, yaituterkait dengan antusiasme belajar, kreativitas, kemampuan penyelesaian masalah, serta kemampuansosial dan kerja sama siswa.",
    "nim": "K3516035"
  },
  {
    "id": "84507",
    "judul": "Implementasi Data Mining untuk Memprediksi Masa Studi Mahasiswa Menggunakan Metode C4.5 (Studi Kasus PTIK FKIP UNS)",
    "abstrak": "Tujuan penelitian ini untuk mengetahui faktor-faktor yang mempengaruhi masa studi mahasiswa dan prediksi kelulusan masa studi mahasiswa melalui penelitian Data Mining menggunakan algoritma C4.5Penelitian ini merupakan penelitian kuantitatif. Data alumni 2012 hingga 2015 yang didapat memiliki persentase rata-rata mahasiswa yang lulus tepat waktu adalah 22%. Data yang diuji adalah data alumni mahasiswa 2012 hingga 2015. Instrumen yang diteliti antara lain masa studi, tahun akademik, IPK, fokus penjurusan, jenis kelamin, intensitas bekerja selama kuliah, jenis skripsi, intensitas organisasi internal kampus, intensitas organisasi eksternal kampus, golongan UKT, status penerima beasiswa, pendidikan sebelum kuliah, intensitas hobi, intensitas bermain game, status keikutsertaan kompetisi akademik, status keikutsertaan kompetisi non-akademik, dan ketersediaan sarana dan prasarana. Hasil pengujian terbaik dengan memakai percentage-split 75% memperoleh akurasi 83,33% serta aturan-aturan yang terdapat dalam pohon keputusan.Kata Kunci: Algoritma C4.5, Data Mining, Prediksi Masa Studi",
    "nim": "K3516004"
  },
  {
    "id": "68242",
    "judul": "Pengembangan Aplikasi Reward System Berbasis Android sebagai Pendukung Penilaian Keaktifan Siswa dalam Pembelajaran",
    "abstrak": "ABSTRAKPenelitian ini bertujuan untuk (1) Terciptanya aplikasi Reward System berbasis Android sebagai pendukung penilaian keaktifan siswa dalam pembelajaran,  (2)  Mengetahui  kelayakan   aplikasi   Reward  System  berbasis Android sebagai pendukung penilaian keaktifan siswa dalam pembelajaran.Jenis penelitian ini yaitu penelitian dan pengembangan. Penelitian ini dilakukan di SMK N 5 Surakarta. Model pengembangan aplikasi yang digunakan adalah model waterfall. Tahapan pada model waterfall meliputi analisis, perancangan, pengkodean dan pengujian. Pengkodean aplikasi menggunakan bahasa pemrograman PHP, dengan memanfaatkan template bootstrap untuk mendesain tampilan, dan intel XDK untuk build dalam bentuk aplikasi Android. Pengujian aplikasi dilakukan oleh seorang ahli media, seorang guru dan sepuluh siswa dengan lembar kuisioner. Adapun aspek yang di uji berdasarkan ISO 25010, yang meliputi aspek fungsional, keefisienan, kebergunaan dan kehandalan.Aplilkasi reward system berfungsi menyimpan dan menampilkan data perolehan reward siswa yang telah berperan aktif dalam pembelajaran. Reward ini dapat  dilihat  siswa  melalui  smartphone  pribadinya.  Reward  yang  diberikan kepada siswa berupa nilai tambahan yang diwakili sebuah medali. Data reward yang dilihat oleh siswa merupakan data  yang  ditambahkan oleh guru melalui smarphone pribadinya, pada tiap kompetensi dasar (KD) sesuai dengan mata pelajaran dan kelas yang diampu oleh guru.Hasil penelitian ini menunjukkan bahwa aplikasi reward system telah memenuhi aspek fungsional, aspek kebergunaan, aspek keefisienan dan aspek kehandalan dengan kategori sangat layak. Hasil persentase yang diperoleh dari pengujian aspek fungsional dengan indikator keberhasilan fungsi mendapatkan hasil 100%, dan termasuk kategori sangat layak; aspek kebergunaan dengan indikator kebermanfaatan, kemudahan penggunaan, kemudahan dipelajari dan kepuasan  pengguna  mendapatkan  hasil  86,2%,  dan  termasuk  kategori  sangat layak; aspek keefisienan dengan indikator kecepatan waktu respon tiap halaman mendapatkan hasil 93,1%, dan termasuk kategori sangat layak; terakhir, aspek kehandalan dengan indikator dapat digunakan pada berbagai versi Android dan berbagai ukuran layar mendapatkan persentase hasil 100%, dan termasuk kategori sangat  layak.  Akan  lebih  baik  jika  aplikasi  ini  dapat  digunakan  dalam  mode offline dan terdapat fitur cetak report data. Kemudian, penelitian akan lebih sempurna jika disertakan pengujian tingkat keefektifan penggunaan aplikasi terhadap keaktifan siswa dalam pembelajaran.Kata Kunci : reward, aplikasi android, keaktifan ",
    "nim": "K3513055"
  }
]
